
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РозничнаяСтоимость=Номенклатура.Итог("РозничнаяСтоимость");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента);
	

	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
		
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента)
	
	//Проверяем заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	СтруктураОбязательныхПолей.Вставить("Склад","Не выбран склад.");
	
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Проверяем заполнение табличной части 
	
	СтруктураОбязательныхПолей = Новый Структура();
	СтруктураОбязательныхПолей.Вставить("НоменклатураПродаж","Не выбрана номенклатура");
	ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "Номенклатура", СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Счет9120=ПланыСчетов.Хозрасчетный.НайтиПоКоду("9120");
	Счет2920=ПланыСчетов.Хозрасчетный.НайтиПоКоду("2920");
	Счет2980=ПланыСчетов.Хозрасчетный.НайтиПоКоду("2980");
	
	Для Каждого Строка Из Номенклатура Цикл
		
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание = "Списание себестоимости";
		
		Проводка.СчетДт      = Счет9120;
		УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.НоменклатураПродаж);
		
		Проводка.СчетКт = Счет2920;
		УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Строка.НоменклатураПродаж);
		УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Склад);
		
		Проводка.КоличествоКт = Строка.Количество;
		Проводка.Сумма = Строка.Себестоимость;
		
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание = "Списание наценки";
		
		Проводка.СчетДт      = Счет2980;
		УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, Строка.НоменклатураПродаж);
		УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, Склад);
		
		Проводка.СчетКт = Счет2920;
		УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, Строка.НоменклатураПродаж);
		УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, Склад);
		
		Проводка.КоличествоДт = Строка.Количество;
		Проводка.Сумма = Строка.Наценка;
		
	КонецЦикла;
	
КонецПроцедуры	
