
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	//Возврат Новый Структура("БухСправка,Исправительная","Бух-справка","Бух-справка исправительная");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента);	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	//Если ИмяМакета="БухСправка" Тогда
	//	ТабДокумент = ПечатьСчетФактура();
	//ИначеЕсли  ИмяМакета="Исправительная" Тогда
	//	ТабДокумент = ПечатьСчетФактураИсправительная();
	//КонецЕсли; 
	//
	//НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Бух-Справка");
	
КонецПроцедуры // Печать()

Процедура ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента)
	
	//Проверяем заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	//Проверяем заполнение табличной части 
	
	СтруктураПолей = Новый Структура();
	ПроверитьЗаполнениеТабличнойЧастиПлатежногоДокумента(ЭтотОбъект, "Получатели", СтруктураПолей, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
	ДвиженияПоНалогуНаВоду= Движения.УчетНалогаНаВоду;	
	
	Для Каждого СтрокаУслуги Из Получатели Цикл
		
		НоваяЗапись = ДвиженияПоНалогуНаВоду.Добавить();
		НоваяЗапись.Период = Ссылка.Дата;
		НоваяЗапись.Организация = Ссылка.Организация;
		НоваяЗапись.Источник = СтрокаУслуги.Источник;
		НоваяЗапись.ВидДеятельности = СтрокаУслуги.ОсновнойВид;
		НоваяЗапись.МестоНахождения = СтрокаУслуги.МестоНахождения;
		НоваяЗапись.количество = СтрокаУслуги.Количество;
		НоваяЗапись.ЦельИспользования = СтрокаУслуги.ЦельИспользования;
	КонецЦикла;	
	
КонецПроцедуры	

Функция ПолучитьСтандартноеПредставлениеДокумента(Ссылка)

	Возврат ПолучитьНомерНаПечать(Ссылка.ПолучитьОбъект()) + " от " + Формат(Ссылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");

КонецФункции 
