
Функция test(WSПрокси=Неопределено) Экспорт
	Если WSПрокси = Неопределено Тогда
		WSПрокси	= WSПроксиПолучить();
	КонецЕсли;
	
	WSПрокси.ZFI_011_RFC_OZBEKISTAN();
	
	//////WSТип			= WSПрокси.ФабрикаXDTO.Пакеты.Получить(0).Получить("ZFI_011_TT_1C_LOG");
	//WSТип			= WSПрокси.ФабрикаXDTO.Тип(URIПространстваИменПолучить(), "ZFI_011_TT_1C_LOG");
	//WSПараметр		= WSПрокси.ФабрикаXDTO.Создать(WSТип);
	//WSПрокси.ZFI_011_RFC_OZBEKISTAN_RTRN(WSПараметр);
КонецФункции

Функция Запросить(Адрес) Экспорт
	Ответ	= "";
	Сервер		= СерверПолучить(Адрес);
	Если НЕ ПустаяСтрока(Сервер) И НастройкиПолучить() Тогда
		HTTPСоединение = HTTPСоединениеПолучить(Сервер);
		HTTPЗапрос	= Новый HTTPЗапрос(Адрес, ЗаголовкиПолучить());
		HTTPОтвет	= HTTPСоединение.Получить(HTTPЗапрос);			// 		GET
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Ответ	= HTTPЗапрос.ПолучитьТелоКакСтроку();
			//ЭлектронноеВзаимодействиеССерверомDidox.ПрочитатьСтрокуJSON(
		//ИначеЕсли HTTPОтвет.КодСостояния >= 400 Тогда
		//	HTTPОтвет	= HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);			// 		POST
		//	Если HTTPОтвет.КодСостояния = 200 Тогда
		//		Ответ	= HTTPЗапрос.ПолучитьТелоКакСтроку();
		//	Иначе
		//		Ответ	= Строка(HTTPОтвет.КодСостояния) + " " + Адрес;
		//	КонецЕсли;
				
		Иначе
			Ответ	= Строка(HTTPОтвет.КодСостояния) + " " + Адрес;
		КонецЕсли;
	КонецЕсли;
	Возврат ?(Ответ=Неопределено, "", Ответ);
КонецФункции

Функция СервисыПолучить(Адрес="") Экспорт
	Ответ	= "";
	Если НастройкиПолучить() Тогда
		WSОпределения	= WSОпределенияПолучить(?(ПустаяСтрока(Адрес), "http://193.138.173.68:8000/sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c/zfi_011_fg_1c?sap-client=200", Адрес));
		Если ТипЗнч(WSОпределения) = Тип("WSОпределения") Тогда
			Для Каждого Сервис Из WSОпределения.Сервисы Цикл
				Ответ	= Ответ + Сервис.Имя + Символы.ВК;
			КонецЦикла;
		Иначе
			Возврат WSОпределения;
		КонецЕсли;
	КонецЕсли;
	Возврат	Ответ;
КонецФункции

Функция WSОпределенияПолучить(УРЛ)
	Попытка
		Если ЗащищенноеСоединение Тогда
			WSОпределения	= Новый WSОпределения(УРЛ, Пользователь, Пароль,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		Иначе
			WSОпределения	= Новый WSОпределения(УРЛ, Пользователь, Пароль,, Таймаут);
		КонецЕсли;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	Возврат WSОпределения;
КонецФункции

Функция ПользовательПолучить()
КонецФункции

Функция HTTPСоединениеПолучить(Сервер, Порт=8000)
	Если ЗащищенноеСоединение Тогда
		HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль,, Таймаут);
	КонецЕсли;
	Возврат HTTPСоединение;
КонецФункции

Функция НастройкиПолучить(Объект=Неопределено)
	Пользователь	= "d_retmind";
	Пароль			= "Sap1234!";
	Если Объект <> Неопределено Тогда
		Объект.Пользователь	= Пользователь;
		Объект.Пароль		= Пароль;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ЗаголовкиПолучить()
	Ответ	= Новый Соответствие;
	Ответ.Вставить("Accept-Encoding",	"gzip,deflate");
	Ответ.Вставить("Accept",			"*/*");
	Ответ.Вставить("Connection",		"keep-alive");
	Ответ.Вставить("content-type",		"application/json");
	//Ответ.Вставить("content-type",	"text/html");
	//Ответ.Вставить("charset",		"utf-8");
	//Ответ.Вставить("sap-server",	"true");
	Ответ.Вставить("sap-client",	"200");
	Возврат Ответ;
КонецФункции

Функция СерверПолучить(Знач Адрес)
	Ответ	= "";
	Если НРег(Лев(Адрес, 7)) = "http://" Тогда
		Адрес	= Сред(Адрес, 8);
	КонецЕсли;
	Для Итератор = 1 По СтрДлина(Адрес) Цикл
		Если Сред(Адрес, Итератор, 1) = "/"  Тогда
			Прервать;
		Иначе
			Ответ	= Ответ + Сред(Адрес, Итератор, 1);
		КонецЕсли;
	КонецЦикла;
	Если Найти(Ответ, ".") = 0 Тогда
		Ответ	= СерверДефолт();
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СерверДефолт()
	Возврат "193.138.173.68";
КонецФункции

Функция АдресаПолучить() Экспорт
	Ответ = Новый Массив;
	//Ответ.Добавить("sap/bc/srt/wsdl");
	//Ответ.Добавить("sap/bc/srt/wsdl/flv_10002A111AD1");
	////Ответ.Добавить("sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c");
	//Ответ.Добавить("sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c?sap-client=200");
	Ответ.Добавить("sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c/zfi_011_fg_1c");
	//Ответ.Добавить("sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c/zfi_011_fg_1c?sap-client=200");
	Возврат Ответ;
КонецФункции

Функция WSПроксиПолучить(ИндексТочкиПодключения=0) Экспорт
	WSСервис	= WSСервисПолучить();
	Точка		= WSСервис.ТочкиПодключения.Получить(ИндексТочкиПодключения);
	Если ЗащищенноеСоединение Тогда
		WSПрокси	= WSСсылки.ОбменSAP.СоздатьWSПрокси(WSСервис.URIПространстваИмен, WSСервис.Имя, Точка.Имя,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL, Точка.Местоположение);
	Иначе
		WSПрокси	= WSСсылки.ОбменSAP.СоздатьWSПрокси(WSСервис.URIПространстваИмен, WSСервис.Имя, Точка.Имя,, Таймаут);
	КонецЕсли;
	НастройкиПолучить(WSПрокси);
	Возврат WSПрокси;
КонецФункции

Функция WSОпределениеПолучить()
	Возврат WSСсылки.ОбменSAP.ПолучитьWSОпределения();
КонецФункции

Функция WSСервисПолучить() Экспорт
	WSОпределение	= WSОпределениеПолучить();
	WSСервис		= WSОпределение.Сервисы.Получить(0);
	Возврат WSСервис;
КонецФункции

Функция URIПространстваИменПолучить(WSСервис=Неопределено)
	Если WSСервис = Неопределено Тогда
		WSСервис = WSСервисПолучить();
	КонецЕсли;
	Возврат WSСервис.URIПространстваИмен;
КонецФункции


Таймаут = 30;

//	http://193.138.173.68:8000/sap/bc/srt/wsdl/flv_10002A111AD1/bndg_url/sap/bc/srt/rfc/sap/zfi_011_fg_1c/200/zfi_011_fg_1c/zfi_011_fg_1c?sap-client=200
