
Процедура ПередЗаписью(Отказ)
	
	Если Не ОсобыйСпособОтраженияРасходовБУ Тогда
		СпособОтраженияРасходовБУ="";
	КонецЕсли; 
	
	Если ОсобыйСпособОтраженияРасходовБУ И СпособОтраженияРасходовБУ.Пустая() Тогда
		Сообщить("Не выбран способ отражения расходов (БУ)!");
		ОсобыеСтатьиРасходовБУ=ложь;
		СтатьяЗатратБУ="";
		РасходыПериодаБУ="";
		Отказ=истина;
	КонецЕсли; 	
	
	Если НеоблагаетсяЕСП И ВидНачисленийНеоблагаемыхЕСП.Пустая() Тогда
		Сообщить("Не выбран вид выплат, на которые не начисляется ЕСП!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если НеоблагаетсяПФ И ВидыНачисленийНеоблагаемыхВзносамиВПФ.Пустая() Тогда
		Сообщить("Не выбран вид выплат, на которые не начисляются взносы в ПФ!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ВидДохода = Перечисления.ВидыДохода.ИмущественныйДоход И ВидИмущественногоДохода.Пустая() Тогда
		Сообщить("Не выбран вид имущественного дохода!");
		Отказ = Истина;
	КонецЕсли; 	
	
	Если ЛьготаПоНДФЛ И ВидЛьготыПоНДФЛ.Пустая() Тогда
		Сообщить("Не выбран вид льготы по налогу на доход физ.лиц!");
		Отказ = Истина;
	КонецЕсли; 	
	
КонецПроцедуры
