
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("СчетНаОплату","Счет на оплату");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПоДокументу=Номенклатура.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	Если Дата<Дата(2019,01,22) Тогда
		Макет = ПолучитьМакет("Счет2018");
	Иначе 	
		Макет = ПолучитьМакет("Счет");
	КонецЕсли;

	
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	
	СведенияОКонтрагенте=СведенияОЮрФизЛице(Контрагент, БанковскийСчетКонтрагента, Дата);
	СведенияОбОрганизации=СведенияОЮрФизЛице(Организация, БанковскийСчет, Дата);
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.накл = накл;
	Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(СведенияОбОрганизации);
	Область.Параметры.Заполнить(СведенияОКонтрагенте);
	Область.Параметры.Валюта = Валюта;
	ТабДок.Вывести(Область);
	
	ВалВсего=0;
	
	Для Каждого СтрокаУслуги из Номенклатура  Цикл
		
		Если СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС ИЛИ
			 СтрокаУслуги.СтавкаНДС = Перечисления.СтавкиНДС.ПустаяСсылка()Тогда
			Область = Макет.ПолучитьОбласть("СтрокаБезНДС");
			Область.Параметры.Заполнить(СтрокаУслуги);
		Иначе	
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(СтрокаУслуги);
			Область.Параметры.Всего=СтрокаУслуги.Сумма+СтрокаУслуги.СуммаНДС;
			ВалВсего=ВалВсего+СтрокаУслуги.Сумма+СтрокаУслуги.СуммаНДС;
		КонецЕсли;

		ТабДок.Вывести(Область);
		
	КонецЦикла; 
	
	Область = Макет.ПолучитьОбласть("Подвал");
	
	Область.Параметры.ВалСумма=Номенклатура.Итог("Сумма");
	Область.Параметры.ВалСуммаНДС=Номенклатура.Итог("СуммаНДС");
	Область.Параметры.ВалВсего=ВалВсего;
	
	Область.Параметры.ВсегоПрописью=СформироватьСуммуПрописью(Номенклатура.Итог("Сумма")+Номенклатура.Итог("СуммаНДС"), Валюта);
	
	Область.Параметры.Заполнить(Руководители);
	
	ТабДок.Вывести(Область);
	
	ТабДок.ФиксацияСверху=0;
	ТабДок.ФиксацияСлева=0;
	ТабДок.ЭкземпляровНаСтранице=0;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.Автомасштаб = Истина;
	ТабДок.КлючПараметровПечати="КПП_СчетНаОплату";
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()


