
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	
	Если не ЕстьПолныеПрава() Тогда
	Если РасчетныйПериод<>Константы.ТекущийРасчетныйПериод.Получить() Тогда
		Отказ=истина;
		Предупреждение("Для проведения документа смените расчетный период на "+Формат(РасчетныйПериод,"ДФ=MMMM.yyyy"));
	КонецЕсли; 
	Конецесли;
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	//ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
		
	ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Для каждого СтрокаРасчеты из Расчеты Цикл
		
		Если СтрокаРасчеты.НачальноеСальдоДебет<>0 Тогда
			Движение=Движения.Сальдо.Добавить();
			Движение.ПериодРегистрации=НачалоМесяца(Дата);
			Движение.Организация=Организация;
			Движение.Сотрудник=СтрокаРасчеты.Сотрудник;
			Движение.ВидРасчета=ПланыВидовРасчета.Сальдо.НачальноеСальдоДебет;
			Движение.Результат=СтрокаРасчеты.НачальноеСальдоДебет;
		КонецЕсли; 
	
		Если СтрокаРасчеты.НачальноеСальдоКредит<>0 Тогда
			Движение=Движения.Сальдо.Добавить();
			Движение.ПериодРегистрации=НачалоМесяца(Дата);
			Движение.Организация=Организация;
			Движение.Сотрудник=СтрокаРасчеты.Сотрудник;
			Движение.ВидРасчета=ПланыВидовРасчета.Сальдо.НачальноеСальдоКредит;
			Движение.Результат=СтрокаРасчеты.НачальноеСальдоКредит;
		КонецЕсли; 
		
		Если СтрокаРасчеты.НачальноеСальдоДебет<>0 Тогда
			Проводка=Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";     
			
			Проводка.СчетДт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("6710");
			УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,СтрокаРасчеты.Сотрудник);
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
			
			Проводка.Сумма = СтрокаРасчеты.НачальноеСальдоДебет; 

		КонецЕсли; 
	
		Если СтрокаРасчеты.НачальноеСальдоКредит<>0 Тогда
			Проводка=Движения.Хозрасчетный.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";     
			
			Проводка.СчетДт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
			
			Проводка.СчетКт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("6710");
			УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,СтрокаРасчеты.Сотрудник);
			
			Проводка.Сумма = СтрокаРасчеты.НачальноеСальдоКредит; 
		КонецЕсли; 
		
	КонецЦикла; 
	
	Движения.Сальдо.Записать();
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если не ЕстьПолныеПрава() Тогда
	Если РасчетныйПериод<>Константы.ТекущийРасчетныйПериод.Получить() Тогда
		Отказ=истина;
		Предупреждение("Для отмены проведения документа смените расчетный период на "+Формат(РасчетныйПериод,"ДФ=MMMM.yyyy"));
	КонецЕсли; 
	Конецесли;
	
КонецПроцедуры

