
Процедура ОбработкаПроведения(Отказ, Режим)
	Для Каждого ТекСтрокаСотрудник Из Сотрудник Цикл
		// регистр РегистрацияРабочихДнейДляДопНачислений 
		Движение = Движения.РегистрацияРабочихДнейДляДопНачислений.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ПодразделениеОрганизации = ТекСтрокаСотрудник.ПодразделениеОрганизации;
		Движение.Сотрудник = ТекСтрокаСотрудник.Сотрудник;
		Движение.ПериодРегистрации = НачалоМесяца(Дата);
		Движение.ОтработанныеДни = ТекСтрокаСотрудник.ОтработанныеДни;
		//Движение.ПерваяПоловинаМесяца = ПерваяПоловинаМесяца;
	КонецЦикла;
КонецПроцедуры
