
&НаКлиенте
Процедура ВозвращатьВНОБДляНалогаНаПрибыльПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура Приложение3ПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура Приложение5ПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры
&НаКлиенте

Процедура Установитьвидимость()
	Элементы.ГрафаПриложения1.Видимость = Объект.ВозвращатьВНОБДляНалогаНаПрибыль;
	Элементы.ГрафаПриложения3.Видимость = Объект.Приложение3;
	Элементы.ГрафаПриложения5.Видимость = Объект.Приложение5;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Установитьвидимость();
	//ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаРегистра");
	ТЗ = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СрезПоследних(ТекущаяДата(),новый структура("СтатьяЗатрат",Объект.Ссылка)).Скопировать();
	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаРегистра");	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	ОписаниеПриложений="";
	Если ТаблицаРегистра.Количество()<> 0 Тогда
		ОписаниеПриложений = ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения3)),"Приложение №3- " + Строка(ТаблицаРегистра[0].СтрокаПриложения3)+ Символы.ПС,"");
		ОписаниеПриложений = ОписаниеПриложений + ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения4)),"Приложение №4- " + Строка(ТаблицаРегистра[0].СтрокаПриложения4)+ Символы.ПС,"");
		ОписаниеПриложений = ОписаниеПриложений + ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения7)),"Приложение №7- " + Строка(ТаблицаРегистра[0].СтрокаПриложения7),"");
		Объект.ОписаниеСтрокиПриложенияОтчетности = ОписаниеПриложений;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриложенияНОБНаСервере()
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаРегистра");
	ТЗ.Очистить();
	ТЗ = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СрезПоследних(ТекущаяДата(),новый структура("СтатьяЗатрат",Объект.Ссылка)).Скопировать();
	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаРегистра");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложения(ВыбранноеЗначение,Доппараметры) Экспорт
	ЗаполнитьПриложенияНОБНаСервере();
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложенияНОБ(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПриложения",ЭтаФорма);
	ПередаваемыеПараметры = Новый Структура;
	ПередаваемыеПараметры.Вставить("СтатьяЗатрат",Объект.Ссылка);
    ОткрытьФорму("РегистрСведений.ПриложенияКРасчетуНалогаНаПрибыль.Форма.ФормаСпискаУправляемая",ПередаваемыеПараметры,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
