
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаСообщения = "";
	Для каждого Способ Из Способы Цикл
		Если ЗначениеНеЗаполнено(Способ.Коэффициент) Тогда
			СтрокаСообщения = СтрокаСообщения +Символы.ПС+
				" строка " + Способ.НомерСтроки+": не заполнен коэффициент";
		КонецЕсли; 
	КонецЦикла; 
	
	Если не ПустаяСтрока(СтрокаСообщения) Тогда
		СообщитьОбОшибке("Обнаружены ошибки в заполнении способов отражения расходов:"+СтрокаСообщения,Отказ); 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры
