
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

//#Если Клиент Тогда
//	Если НЕ ТолькоЦифрыВСтроке(СокрЛП(НомерСчета)) И Вопрос("В составе номера банковского счета присутствуют не только цифры. 
//		|Возможно, номер указан неправильно. Записать?",РежимДиалогаВопрос.ДаНет)=КодВозвратаДиалога.Нет Тогда

//		Отказ=Истина;
//		
//	КонецЕсли;
//#КонецЕсли

КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры