
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("ПрофильНастроекЭДО", ПрофильНастроекЭДО);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СгенерироватьПарольНаСервере()
	Возврат Справочники.ПрофилиНастроекЭДО.СгенерироватьНовыйПароль(20);
КонецФункции

&НаКлиенте
Процедура СгенерироватьПароль(Команда)
	НовыйПароль = СгенерироватьПарольНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	СтруктураОтвета = ПодтвердитьНаСервере();
	Если СтруктураОтвета.Успешно Тогда
		ИзменитьПарольПрофиляЭДОНаСервере();
		Оповестить("ИзменениеПароля");
		Закрыть();
	Иначе
		Сообщить(СтруктураОтвета.СообщитьПользователю);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИзменитьПарольПрофиляЭДОНаСервере()
	
	Объект = ПрофильНастроекЭДО.ПолучитьОбъект();
	Объект.Пароль = НовыйПароль;
	Объект.Записать();
	
КонецФункции

&НаСервере
Функция ПодтвердитьНаСервере()
	
	Возврат ЭлектронноеВзаимодействиеССерверомDidox.ИзменитьПарольПрофиляЭДО(ПрофильНастроекЭДО, НовыйПароль);
	
КонецФункции
