
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Печать","Печать");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);

	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	//ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента);
	
	Если НЕ Отказ Тогда
		
		НачислениеАмортизацииНМА(СтруктураШапкиДокумента, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Таб = Новый ТабличныйДокумент;
	ФормаОтчета = Отчеты.ОтчетПоНМАПоГруппам.ПолучитьФорму();
	ФормаОтчета.Организация = Организация;
	ФормаОтчета.Отчет(Таб,Дата,Дата);
	
	Таб.ОтображатьЗаголовки=ложь;
	Таб.ОтображатьСетку=Ложь;
	
	Таб.Показать("Отчет по НМА");
	
КонецПроцедуры // Печать()

Процедура НачислениеАмортизацииНМА(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Начисление амортизации ОС в бухгалтерском учете.
	ТабАмортизации  = РасчетАмортизацииНМА(Дата, СтруктураШапкиДокумента.Организация);
	
	ТабАмортизации.Колонки.Добавить("МОЛ");
	ТабАмортизации.Колонки.Добавить("Подразделение");
	ТабАмортизации.Колонки.Добавить("ГруппаОС");
	
	ТабАмортизации.Колонки.Бух.Имя = "Сумма";
	ТабАмортизации.Колонки.НематериальныйАктив.Имя  = "ОбъектУчета";
	ТабАмортизации.Колонки.СчетАмортизацииБУ.Имя = "СчетАмортизации";
	ТабЗатрат = ПолучитьРаспределениеАмортизацииПоНаправлениямРегл(ЭтотОбъект, Отказ, Заголовок, ТабАмортизации, СтруктураШапкиДокумента, "Бух", "НМА");
	
КонецПроцедуры // НачислениеАмортизации()


Процедура ПроверитьЗаполнениеДокумента(Отказ, Заголовок, СтруктураШапкиДокумента)
	
	//Проверяем заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура("Организация");
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры
