
Процедура Отчет(ТабДок) Экспорт
	
	Макет = ПолучитьМакет("Отчет");
	
	тз=новый ТаблицаЗначений;
	тз.Колонки.Добавить("Период");
	тз.Колонки.Добавить("Регистратор");
	тз.Колонки.Добавить("Местонахождение");
	тз.Колонки.Добавить("МОЛ");
	тз.Колонки.Добавить("КоэффициентАмортизации");
	тз.Колонки.Добавить("НачислятьАмортизацию");
	тз.Колонки.Добавить("ПроизводственнаяГруппа");
	тз.Колонки.Добавить("ПротивопожарныеОС");
	тз.Колонки.Добавить("ОСПоОхранеОкружающейСреды");
	тз.Колонки.Добавить("СпособыОтраженияРасходовПоАмортизации");
	тз.Колонки.Добавить("СчетУчета");
	тз.Колонки.Добавить("СчетНачисленияАмортизации");
	
	Запрос=новый Запрос;
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ОсновноеСредство",ОсновноеСредство);
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчет.Период,
	|	МестонахождениеОСБухгалтерскийУчет.Регистратор,
	|	МестонахождениеОСБухгалтерскийУчет.МОЛ,
	|	МестонахождениеОСБухгалтерскийУчет.Местонахождение
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет КАК МестонахождениеОСБухгалтерскийУчет
	|ГДЕ
	|	МестонахождениеОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И МестонахождениеОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		
		СтрокаТз.МОЛ=Строка.МОЛ;
		СтрокаТз.Местонахождение=Строка.Местонахождение;
		
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	НачислениеАмортизацииОСБухгалтерскийУчет.Период,
	|	НачислениеАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	НачислениеАмортизацииОСБухгалтерскийУчет.НачислятьАмортизацию
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет КАК НачислениеАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	НачислениеАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И НачислениеАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.НачислятьАмортизацию=Строка.НачислятьАмортизацию;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.Период,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.КоэффициентАмортизации
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет КАК ПараметрыАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И ПараметрыАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.КоэффициентАмортизации=Строка.КоэффициентАмортизации;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Период,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Регистратор,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.СпособПоступления,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПроизводственнаяГруппа,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ПротивопожарныеОС,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ОСПоОхранеОкружающейСреды,
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.Состояние
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет КАК ПервоначальныеСведенияОСБухгалтерскийУчет
	|ГДЕ
	|	ПервоначальныеСведенияОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И ПервоначальныеСведенияОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.ПроизводственнаяГруппа=Строка.ПроизводственнаяГруппа;
		СтрокаТз.ПротивопожарныеОС=Строка.ПротивопожарныеОС;
		СтрокаТз.ОСПоОхранеОкружающейСреды=Строка.ОСПоОхранеОкружающейСреды;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СчетаБухгалтерскогоУчетаОС.Период,
	|	СчетаБухгалтерскогоУчетаОС.Регистратор,
	|	СчетаБухгалтерскогоУчетаОС.СчетНачисленияАмортизации,
	|	СчетаБухгалтерскогоУчетаОС.СчетУчета
	|ИЗ
	|	РегистрСведений.СчетаБухгалтерскогоУчетаОС КАК СчетаБухгалтерскогоУчетаОС
	|ГДЕ
	|	СчетаБухгалтерскогоУчетаОС.ОсновноеСредство = &ОсновноеСредство
	|	И СчетаБухгалтерскогоУчетаОС.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.СчетНачисленияАмортизации=Строка.СчетНачисленияАмортизации;
		СтрокаТз.СчетУчета=Строка.СчетУчета;
	КонецЦикла;	
	//==============================
	Запрос.Текст=
	"ВЫБРАТЬ
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Период,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Регистратор,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СпособыОтраженияРасходовПоАмортизации
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет
	|ГДЕ
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.ОсновноеСредство = &ОсновноеСредство
	|	И СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Организация = &Организация";
	
	РезультатЗапроса=Запрос.Выполнить().Выгрузить();
	
	Для каждого Строка из  РезультатЗапроса Цикл
		СтрокаТз=тз.Найти(Строка.Регистратор);
		Если СтрокаТз=Неопределено Тогда
			СтрокаТз=тз.Добавить();
			СтрокаТз.Период=Строка.Период;
			СтрокаТз.Регистратор=Строка.Регистратор;
		КонецЕсли;	
		СтрокаТз.СпособыОтраженияРасходовПоАмортизации=Строка.СпособыОтраженияРасходовПоАмортизации;
	КонецЦикла;	
	
	тз.сортировать("Период,Регистратор");
	
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьДетали = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();

	Для Каждого СтрокаТз из тз Цикл
		ОбластьДетали.Параметры.Заполнить(СтрокаТз);
		ТабДок.Вывести(ОбластьДетали);
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	
КонецПроцедуры

