
Процедура Отчет(ТабДок, КонецПериода, Склад, Счета,Организация,ДанныеДляПечати,ФильтрОКС) Экспорт
	//{{КОНСТРУКТОР_ВЫХОДНЫХ_ФОРМ(Отчет)
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Макет = ПолучитьМакет("Отчет");
	Запрос = Новый Запрос;
	
		
		

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ХозрасчетныйОстатки.Субконто1,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Субконто1),
	|	СУММА(ХозрасчетныйОстатки.СуммаОстатокДт) КАК Сумма,
	|	СУММА(ХозрасчетныйОстатки.КоличествоОстатокДт) КАК Количество,
	|	ХозрасчетныйОстатки.Счет,
	|	ПРЕДСТАВЛЕНИЕ(ХозрасчетныйОстатки.Счет),
	|	ХозрасчетныйОстатки.Субконто1.Код,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстатокДт = 0
	|			ТОГДА """"
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстатокДт ЕСТЬ NULL 
	|			ТОГДА """"
	|		КОГДА ХозрасчетныйОстатки.СуммаОстатокДт ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт / ХозрасчетныйОстатки.КоличествоОстатокДт
	|	КОНЕЦ КАК ЦЕНА,
	|	ХозрасчетныйОстатки.Субконто1.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Остатки(
	|			&КонецПериода,
	|			Счет В (&Счета),
	|			,
	|			Организация = &Организация
	|				И Субконто2 = &Склад ) КАК ХозрасчетныйОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ХозрасчетныйОстатки.Счет,
	|	ХозрасчетныйОстатки.Субконто1,
	|	ХозрасчетныйОстатки.Субконто1.Код,
	|	ХозрасчетныйОстатки.Субконто1.БазоваяЕдиницаИзмерения,
	|	ВЫБОР
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстатокДт = 0
	|			ТОГДА """"
	|		КОГДА ХозрасчетныйОстатки.КоличествоОстатокДт ЕСТЬ NULL 
	|			ТОГДА """"
	|		КОГДА ХозрасчетныйОстатки.СуммаОстатокДт ЕСТЬ NULL 
	|			ТОГДА """"
	|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстатокДт / ХозрасчетныйОстатки.КоличествоОстатокДт
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ХозрасчетныйОстатки.Счет.Код,
	|	ХозрасчетныйОстатки.Субконто1.Код";
	
	
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода)+1);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Счета", Счета);
	
	Результат = Запрос.Выполнить();
	
	
	ТабДок.Очистить();
	
	
	Строка = Макет.ПолучитьОбласть("Строка");
	Титул = Макет.ПолучитьОбласть("Титул");
	Страница = Макет.ПолучитьОбласть("Страница");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ИтСтрЧ = Макет.ПолучитьОбласть("ИтСтрЧ");
	ИтСтрП = Макет.ПолучитьОбласть("ИтСтрП");
	ИтОписьЧ = Макет.ПолучитьОбласть("ИтОписьЧ");
	Итог1 = Макет.ПолучитьОбласть("Итог1");
	Итог2 = Макет.ПолучитьОбласть("Итог2");
	ПодписиНаСтраницах = Макет.ПолучитьОбласть("ПодписиНаСтраницах");
	
	Титул.Параметры.Организация=ДанныеДляПечати.Организация;
	Титул.Параметры.Склад=Склад;
	Титул.Параметры.ОснованиеНомер=ДанныеДляПечати.ОснованиеНомер;
	Титул.Параметры.ОснованиеДата=Формат(ДанныеДляПечати.ОснованиеДата,"ДФ=dd.MM.yyyy");
	Титул.Параметры.Номер=ДанныеДляПечати.НомерОписи;
	Титул.Параметры.Дата=Формат(КонецПериода,"ДФ=dd.MM.yyyy");
	Титул.Параметры.Виды=ДанныеДляПечати.Виды;
	Титул.Параметры.МОЛ1=ДанныеДляПечати.МОЛ1;
	Титул.Параметры.МОЛ2=ДанныеДляПечати.МОЛ2;
	Титул.Параметры.МОЛ1Должность=ДанныеДляПечати.МОЛ1.Должность;
	Титул.Параметры.МОЛ2Должность=ДанныеДляПечати.МОЛ2.Должность;
	Титул.Параметры.КодПоОКПО=ДанныеДляПечати.Организация.КодПоОКПО;
	Титул.Параметры.ДатаНачалаИнвентаризации=Формат(ДанныеДляПечати.ДатаНачалаИнвентаризации,"ДФ=dd.MM.yyyy");
	ТабДок.Вывести(Титул);     
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КолСтрокНаЛисте = 33;
	ТекСтрока = КолСтрокНаЛисте;
	ИтогСуммаОпись = 0;
	ИтогКоличОпись = 0;
	ИтогСуммаСтраница = 0;
	ИтогКоличСтраница = 0;
	ПризнакНовСтраница = 0;
	НомерСтр = 2;
	КолНомСтр = 0; // количество строк на текущей странице
	
	Ном = 0; // номер по порядку
	
	МПЗ = Результат.Выбрать();
	Пропущено=0;
	
	Если МПЗ.Количество()>0 Тогда
		
		Пока МПЗ.Следующий() Цикл
			Сумма = МПЗ.Сумма;
			ИнвСумма = МПЗ.Сумма;
			Цена = МПЗ.Цена;
			Если МПЗ.Количество <> 0 Тогда
				Если ТекСтрока = КолСтрокНаЛисте Тогда
					Если ПризнакНовСтраница = 1 Тогда
						ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
						ИтогСуммаСтраница = 0;
						ИтогКоличСтраница = 0;
						КолНомСтр = 0;
						НомерСтр = НомерСтр + 1;
					КонецЕсли;
					ПризнакНовСтраница = 1;
					ТекСтрока = 0;
					Страница.Параметры.НомерСтр=НомерСтр;
					ТабДок.Вывести(Страница);
					ТабДок.Вывести(Шапка);
				КонецЕсли;
				ИтогСуммаОпись = ИтогСуммаОпись + Сумма;
				ИтогКоличОпись = ИтогКоличОпись + МПЗ.Количество;
				ИтогСуммаСтраница = ИтогСуммаСтраница + Сумма;
				ИтогКоличСтраница = ИтогКоличСтраница + МПЗ.Количество;
				КолНомСтр = КолНомСтр+1;
				Ном = Ном + 1;
				ТекСтрока=ТекСтрока+ 1;
				Строка.Параметры.Ном=Ном;
				Строка.Параметры.Заполнить(МПЗ);
				ТабДок.Вывести(Строка);
				Если ТекСтрока = КолСтрокНаЛисте Тогда
					ИтСтрЧ.Параметры.ИтогКоличСтраница=ИтогКоличСтраница;
					ИтСтрЧ.Параметры.ИтогСуммаСтраница=ИтогСуммаСтраница;
					ТабДок.Вывести(ИтСтрЧ);
					Если Ном<>(МПЗ.Количество()-Пропущено) Тогда
						ТабДок.Вывести(ПодписиНаСтраницах);
					КонецЕсли;
					Если Ном < МПЗ.Количество() Тогда
						//ИтСтрП.Параметры.КолНомСтр=СтрЗаменить(ЧислоПрописью(КолНомСтр),"00","");
						//ТабДок.Вывести(ИтСтрП);
					КонецЕсли;
				КонецЕсли;
			Иначе	
				Пропущено=Пропущено+1;
			КонецЕсли;
		КонецЦикла;
		Если ТекСтрока < КолСтрокНаЛисте Тогда
			ИтСтрЧ.Параметры.ИтогКоличСтраница=ИтогКоличСтраница;
			ИтСтрЧ.Параметры.ИтогСуммаСтраница=ИтогСуммаСтраница;
			ТабДок.Вывести(ИтСтрЧ);
		КонецЕсли;
		
		ИтОписьЧ.Параметры.ИтогКоличОпись=ИтогКоличОпись;
		ИтОписьЧ.Параметры.ИтогСуммаОпись=ИтогСуммаОпись;
		ТабДок.Вывести(ИтОписьЧ);
		ТабДок.Вывести(ПодписиНаСтраницах);
		
		//ИтСтрП.Параметры.КолНомСтр=СтрЗаменить(ЧислоПрописью(КолНомСтр),"00","");
		//ТабДок.Вывести(ИтСтрП);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		НомерСтр = НомерСтр + 1;
		Итог1.Параметры.НомерСтр=НомерСтр;
		Итог1.Параметры.Ном=СтрЗаменить(ЧислоПрописью(Ном),"00","");
		
		Итог1.Параметры.Председатель=ДанныеДляПечати.ПредседательКомиссии;
		Итог1.Параметры.ПредседательДолжность=ДанныеДляПечати.ПредседательКомиссии.Должность;
		
		ТабДок.Вывести(Итог1);
		
		//Итог.Параметры.Член1=ДанныеДляПечати.ЧленКомиссии1;
		//Итог.Параметры.Член2=ДанныеДляПечати.ЧленКомиссии2;
		//Итог.Параметры.Член3=ДанныеДляПечати.ЧленКомиссии3;
		//
		//Итог.Параметры.Член1Должность=ДанныеДляПечати.ЧленКомиссии1.Должность;
		//Итог.Параметры.Член2Должность=ДанныеДляПечати.ЧленКомиссии2.Должность;
		//Итог.Параметры.Член3Должность=ДанныеДляПечати.ЧленКомиссии3.Должность;
		
		Для каждого ЧленКомиссии Из ЧленыКомиссии Цикл
			Если ЧленКомиссии = ЧленыКомиссии[0] Тогда
				ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии1");
			Иначе	
				ОбластьЧленКомиссии = Макет.ПолучитьОбласть("ЧленКомиссии");
			КонецЕсли; 
			ОбластьЧленКомиссии.Параметры.ЧленКомиссии = ЧленКомиссии.ФизЛицо;
			ОбластьЧленКомиссии.Параметры.ЧленКомиссииДолжность = ЧленКомиссии.ФизЛицо.Должность;
			ТабДок.Вывести(ОбластьЧленКомиссии);
		КонецЦикла;  
		
		Итог2.Параметры.МОЛ1=ДанныеДляПечати.МОЛ1;
		Итог2.Параметры.МОЛ2=ДанныеДляПечати.МОЛ2;
		Итог2.Параметры.МОЛ1Должность=ДанныеДляПечати.МОЛ1.Должность;
		Итог2.Параметры.МОЛ2Должность=ДанныеДляПечати.МОЛ2.Должность;
		
		Итог2.Параметры.Проверяющий=ДанныеДляПечати.Проверящий;
		Итог2.Параметры.ПроверяющийДолжность=ДанныеДляПечати.Проверящий.Должность;
		
		ТабДок.Вывести(Итог2);
		ТабДок.Автомасштаб=истина;
		ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
		Предупреждение("Опись сформирована!");
	Иначе
		Предупреждение("Нет остатков по выбранному складу!");
	КонецЕсли; 

КонецПроцедуры

