
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоРегистрамБУ(Режим, Отказ, Заголовок, СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоРегистрамБУ(РежимПроведения, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	Проводка = Движения.Хозрасчетный.Добавить();
	Проводка.Период      = Дата;
	Проводка.Организация = Организация;
	Проводка.Содержание = Содержание;     
	
	Проводка.СчетДт      = Платеж.СчетЗатрат;
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,Платеж.Субконто1);
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,Платеж.Субконто2);
	УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,3,Платеж.Субконто3);
	
	Проводка.СчетКт     =  Платеж.СчетУчета;
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Платеж.СчетУчетаСубконто1);
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,Платеж.СчетУчетаСубконто2);
	УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,Платеж.СчетУчетаСубконто3);
	Проводка.Сумма = Сумма; 
	
	Движения.Хозрасчетный.Записать();
	
КонецПроцедуры	 
