
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПП","Платежное поручение на продажу валюты");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Функция ПечатьПП(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ППНаПродажуВалюты");
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	Область = Макет.ПолучитьОбласть("ПП");
	
	Область.Параметры.Номер = Формат(Номер,"ЧГ=0");
	Область.Параметры.Банк = ТранзитныйБанковскийСчет.Банк.Наименование;
	Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	
	Область.Параметры.Заполнить(Руководители);
	Область.Параметры.ТранзитныйСчет = ТранзитныйБанковскийСчет.НомерСчета;
	Область.Параметры.ВалютныйСчет = ВалютныйБанковскийСчет.НомерСчета;
	Область.Параметры.СумовыйСчет = СумовыйБанковскийСчет.НомерСчета;
	Область.Параметры.Организация = Организация;
	
	Область.Параметры.Валюта = Валюта;
	Область.Параметры.Курс = Курс;
	Область.Параметры.Кратность = Кратность;
	Область.Параметры.ПроцентПродажи=ПроцентПродажи;
	Область.Параметры.Договор=Договор;
	
	Область.Параметры.СуммаВыручки = Формат(СуммаВыручки,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	Область.Параметры.СуммаЗачисления =Формат(СуммаЗачисления,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	Область.Параметры.СуммаПродажи = Формат(СуммаПродажи,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");;
	Область.Параметры.СуммаЭквивалент = Формат(СуммаЭквивалент,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");;
	
	Область.Параметры.СуммаЭквивалентПрописью=СформироватьСуммуПрописью(СуммаЭквивалент,Константы.ВалютаРегламентированногоУчета.Получить());
	Область.Параметры.СуммаВыручкиПрописью=СформироватьСуммуПрописью(СуммаВыручки,Валюта);
	Область.Параметры.СуммаЗачисленияПрописью=СформироватьСуммуПрописью(СуммаЗачисления,Валюта);
	Область.Параметры.СуммаПродажиПрописью=СформироватьСуммуПрописью(СуммаПродажи,Валюта);
	ТабДок.Вывести(Область);
	
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьПП(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Плат. пор. на продажу валюты");
	
КонецПроцедуры // Печать()

