
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "PDF (*.pdf)|*.pdf";
	Диалог.Фильтр = Фильтр; 
	Если Диалог.Выбрать() Тогда
		Попытка                          
			ВыбратьФайлНаСервере(Диалог.ПолноеИмяФайла);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки; 		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьФайлНаСервере(Путь)
	
	ПутьКФайлу = Путь;
	//Файл = Новый ХранилищеЗначения(Новый ДвоичныеДанные(ПутьКФайлу));
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры


&НаКлиенте
Процедура ПодписатьИОтправитьЭД(Команда)
	
	ОчиститьСообщения();
	
	Если ПроверитьЗаполнение() И (ЗначениеЗаполнено(ЭлектронныйДокументСсылка)
									ИЛИ ЭтоАдресВременногоХранилища(АдресВременногоХранилищаВложения)) Тогда
		
		Если ДокументЗаписан() Тогда
			ПодписатьИОтправитьДокумент(Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ДокументЗаписан()
	
	ФлагЗаписи = Истина;
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		ФлагЗаписи = Ложь;
		
		ТекстВопроса = НСтр("ru='Для продолжения операции необходимо записать документ. Записать документ?';uz='Оperatsiyani davom ettirish 
							|uchun siz hujjatni yozishingiz kerak. Hujjatni saqlash kerakmi?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Если Ответ = КодВозвратаДиалога.Да И Записать() Тогда
			ФлагЗаписи = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФлагЗаписи;
	
КонецФункции

&НаКлиенте
Процедура ПодписатьИОтправитьДокумент(ФлагОтправить = Ложь) Экспорт
	
	МассивЭД = Новый Массив;
	МассивЭД.Добавить(ЭлектронныйДокументСсылка);
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("МассивНаОтправку", МассивЭД);
	
	Действия = "СформироватьУтвердитьПодписатьОтправить";
	МассивСсылокНаОбъект = Новый Массив;
	МассивСсылокНаОбъект.Добавить(Объект.Ссылка);
	
	ЭлектронныеДокументыСлужебныйКлиент.ОбработатьЭД(МассивСсылокНаОбъект, Действия, ПолучитьСтруктуруДопПараметров(), МассивЭД);
	
	Прочитать();
	//Если ФлагОтправить Тогда
	//	ОбновитьСтатусДокумента(ДополнительныеПараметры);
	//	Оповестить("ОбновитьСостояниеЭД");
	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруДопПараметров()
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ВидЭД", Перечисления.ВидыЭД.ПроизвольныйЭД);
	
	Возврат ДопПараметры;
	
КонецФункции




