Процедура Установить(ФормаСписка, ИмяТабличногоПоля) Экспорт
	
	//Попытка
	//	
	//	ПараметрыСеанса.Организация = ФормаСписка.Организация;
	//	
	//	ФормаСписка[ИмяТабличногоПоля].Отбор.Организация.Использование = Истина;
	//	ФормаСписка[ИмяТабличногоПоля].Отбор.Организация.Значение = ФормаСписка.Организация;
	//	
	//	ФормаСписка.Обновить();
	//	
	//Исключение
	//	
	//	Сообщить("Не удалось установить отбор по организации", СтатусСообщения.Внимание);	
	//	
	//КонецПопытки; 
	
КонецПроцедуры
 
Процедура ПриОткрытии(Форма) Экспорт
	
	//Попытка
	//	
	//	Если ЗначениеНеЗаполнено(Форма.Организация) Тогда
	//		Форма.Организация = ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяОрганизация");	
	//	КонецЕсли; 
	//	
	//	// Проверка ведения однофирменности
	//	Форма.ЭлементыФормы.Организация.ТолькоПросмотр = НЕ УчетПоВсемОрганизациям;
	//	
	//Исключение
	//	
	//	// На форме нет реквизита "Организация"
	//	
	//КонецПопытки; 
	
	
КонецПроцедуры
 
Процедура СправочникиПередЗаписьюПередЗаписью(Источник, Отказ) Экспорт
	
	//Если Не ТипЗнч(Источник) = Тип("СправочникОбъект.Организации") Тогда
	//	Если Источник.Организация.Пустая() Тогда
	//		Источник.Организация = ПолучитьЗначениеПоУмолчанию(глТекущийПользователь, "ОсновнаяОрганизация");
	//	КонецЕсли; 
	//КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьРодителяВерхнегоУровня(ФормаСписка, ИмяТабличногоПоля, СправочникИмя) Экспорт
	
	//Если ПараметрыСеанса.ЭтоЦентральнаяБаза Тогда
	//	Возврат;
	//КонецЕсли; 
	//
	//Попытка
	//	
	//	РодительВУ = Справочники[СправочникИмя].ПБД;
	//	ФормаСписка.ЭлементыФормы[ИмяТабличногоПоля].РодительВерхнегоУровня = РодительВУ;
	//	ФормаСписка.ЭлементыФормы[ИмяТабличногоПоля].ИзменятьИерархическийПросмотр = Ложь;
	//	
	//Исключение
	//	
	//	// Не найдена группа справочника для использования в переферийной базе
	//	
	//КонецПопытки; 	
	
КонецПроцедуры

Функция ПолучитьНоменклатуруПоКоду(Организация,ИмяСправочника,Код) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Организация = &Организация
	|	И Номенклатура.Код ПОДОБНО &Код + ""%"" ";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Код", Код);
	Запрос.Выполнить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;   	
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции
