
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Для каждого Строка Из Сотрудники Цикл
		
		тПериоды = ПолучитьМесяцыЗаПериод(Строка.ДатаНачала, Строка.ДатаОкончания);
		
		Для каждого СтрокаПериодов Из тПериоды Цикл
			Движение = Движения.ДополнительныеРасчеты.Добавить();
			Движение.Период = СтрокаПериодов.Период;
			Движение.Организация = Организация;
			Движение.Сотрудник = Строка.Сотрудник;
			Движение.ВидРасчета = ВидРасчета;
			Движение.СпособРасчета = Перечисления.СпособыРасчетаНачисленияУдержания.Суммой;
			Движение.Параметр = Строка.Сумма;
		КонецЦикла;	
	КонецЦикла; 
	
КонецПроцедуры	

Функция ПолучитьМесяцыЗаПериод(ДатаНачала, ДатаОкончания)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("Период");
	
	Для г = Год(ДатаНачала) По Год(ДатаОкончания) Цикл
		
		тд1 = Макс(ДатаНачала, НачалоГода(Дата(г,1,1)));			
		тд2 = Мин(ДатаОкончания, КонецГода(Дата(г,1,1)));
		
		Для м = Месяц(тд1) По Месяц(тд2) Цикл
			ЭлементРезультата = Результат.Добавить();				
			ЭлементРезультата.Период = Дата(г, м, 1);
		КонецЦикла;					
	КонецЦикла;	        		
	
	Возврат Результат;
	
КонецФункции	