
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ДляСчетаКредитора,ДляСчетаДебитора,ВКассу,НаВЦ","Для счета кредитора","Для счета дебитора","В кассу", "На ВЦ");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Функция ПечатьПП(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет(ИмяМакета);
	
	Область = Макет.ПолучитьОбласть("Шапка");
	
	Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	Область.Параметры.Банк	= БанковскийСчет.Банк;
	Область.Параметры.Организация = Организация;
	
	Если БанковскийСчет.МесяцПрописью Тогда
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	Иначе
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	КонецЕсли; 	
	
	
	Область.Параметры.НомерБанковскогоСчета = БанковскийСчет.НомерСчета;
	Область.Параметры.СуммаПрописью = ПроцедурыСервера.СформироватьСуммуПрописью_Сервер(Сумма,Валюта);
	Область.Параметры.Кому = Выдать;
	Область.Параметры.Куда = Регион;
	
	Область.Параметры.НомерОрдера = Ордер;
	Область.Параметры.НомерГруппы = Группа;
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрокаВалютныйОрдер из ВалютныйОрдер Цикл 
		Область.Параметры.Заполнить(СтрокаВалютныйОрдер);
		Область.Параметры.НомерДебетСчета=СтрокаВалютныйОрдер.ДебетСчета.НомерСчета;
		Область.Параметры.Эквивалент=СтрокаВалютныйОрдер.Сумма*Курс/Кратность;
		ТабДок.Вывести(Область);
	КонецЦикла;	
	
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.НомерПриложения=ПриложениеНомер;
	Область.Параметры.ПриложениеЛист=ПриложениеЛистов;
	
	Если (ИмяМакета="ДляСчетаКредитора") или (ИмяМакета="ВКассу") Тогда 
		ДанныеОФизЛице = ДанныеФизЛица(Организация, Доверенность, Дата);
	    ФИОДоверенного = СокрЛП(ДанныеОФизЛице.Фамилия) + " " + СокрЛП(ДанныеОФизЛице.Имя) + " " + СокрЛП(ДанныеОФизЛице.Отчество);
		Область.Параметры.Паспорт="Паспорт серии "+СокрЛП(ДанныеОФизЛице.ДокументСерия)+" № "+СокрЛП(ДанныеОФизЛице.ДокументНомер)+
								  "Выдан "+СокрЛП(ДанныеОФизЛице.ДокументДатаВыдачи)+" "+СокрЛП(ДанныеОФизЛице.ДокументКемВыдан); 
		Область.Параметры.Доверенность=ФИОДоверенного;
	КонецЕсли;	
	ТабДок.Вывести(Область);
	
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьПП(ИмяМакета);
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Поручение на расходный валютный ордер");
	
КонецПроцедуры // Печать()

