////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета.
Перем мТаблицаСвойстваСчетов Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

////////////////////////////////////////////////////////////////////////////////

ОписаниеТиповСтрока15  = ПолучитьОписаниеТиповСтроки(15);
ОписаниеТиповСтрока50  = ПолучитьОписаниеТиповСтроки(50);
ОписаниеТиповСтрока100 = ПолучитьОписаниеТиповСтроки(100);

мТаблицаСвойстваСчетов    = Новый ТаблицаЗначений;

мТаблицаСвойстваСчетов.Колонки.Добавить( "ИмяНастройки",        ОписаниеТиповСтрока50);
мТаблицаСвойстваСчетов.Колонки.Добавить( "ИмяСчетаБУ",          ОписаниеТиповСтрока100);
мТаблицаСвойстваСчетов.Колонки.Добавить( "КодСчетаБУ",          ОписаниеТиповСтрока50 );
мТаблицаСвойстваСчетов.Колонки.Добавить( "НаименованиеСчетаБУ", ОписаниеТиповСтрока100);
мТаблицаСвойстваСчетов.Колонки.Добавить( "ТипСчета",            ОписаниеТиповСтрока50 );
мТаблицаСвойстваСчетов.Колонки.Добавить( "Забалансовый",        ОписаниеТиповСтрока50 );
мТаблицаСвойстваСчетов.Колонки.Добавить( "Валютный",            ОписаниеТиповСтрока50 );
мТаблицаСвойстваСчетов.Колонки.Добавить( "Количественный",      ОписаниеТиповСтрока50 );
мТаблицаСвойстваСчетов.Колонки.Добавить( "Субконто1",           ОписаниеТиповСтрока100);
мТаблицаСвойстваСчетов.Колонки.Добавить( "Субконто2",           ОписаниеТиповСтрока100);
мТаблицаСвойстваСчетов.Колонки.Добавить( "Субконто3",           ОписаниеТиповСтрока100);
мТаблицаСвойстваСчетов.Колонки.Добавить( "КонтрольСальдоКомментарий",     ПолучитьОписаниеТиповСтроки(700));
мТаблицаСвойстваСчетов.Колонки.Добавить( "ПодлежитЗакрытию",     ПолучитьОписаниеТиповСтроки(1));

