
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НачисленияПоЗаработнойПлате.Ссылка
	|ИЗ
	|	Документ.НачисленияПоЗаработнойПлате КАК НачисленияПоЗаработнойПлате
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(НачисленияПоЗаработнойПлате.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УдержанияПоЗаработнойПлате.Ссылка
	|ИЗ
	|	Документ.УдержанияПоЗаработнойПлате КАК УдержанияПоЗаработнойПлате
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(УдержанияПоЗаработнойПлате.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ТаблицаДвижений = Движения.Хозрасчетный.Выгрузить();
	ТаблицаДвижений.Очистить();
	
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Ссылка);

		НаборЗаписей.Прочитать();         		
		
		ВремТабл = НаборЗаписей.Выгрузить();
		Для каждого СтрокаДвиженийВремТабл Из ВремТабл Цикл
			СтрокаДвижений = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаДвиженийВремТабл);
		КонецЦикла; 
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Загрузить(ТаблицаДвижений);
	
	Если Не ПланыОбмена.ГлавныйУзел() = ПланыОбмена.Полный.ЭтотУзел() Тогда
		Движения.Хозрасчетный.УстановитьАктивность(Ложь);
	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПроверкаВозможностиДобавления(Отказ) Экспорт
	
	Если ПараметрыСеанса.ЭтоЦентральнаяБаза Тогда
		Отказ = Истина;
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПроводкиПоЗаработнойПлате.Ссылка
	               |ИЗ
	               |	Документ.ПроводкиПоЗаработнойПлате КАК ПроводкиПоЗаработнойПлате
	               |ГДЕ
	               |	НАЧАЛОПЕРИОДА(ПроводкиПоЗаработнойПлате.Дата, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Количество() Тогда
		Отказ = Истина;
	КонецЕсли; 
	
КонецПроцедуры
 