
Процедура ПередЗаписью(Отказ)
	
	//Если ЭтоНовый() И НЕ ПараметрыСеанса.ИспользованиеРИБ Тогда
	//	МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
	//	НомерТекущегоСоединения = НомерСоединенияИнформационнойБазы();
	//	Для каждого Соединение ИЗ МассивСоединений Цикл
	//		Если Соединение.ИмяПриложения <> "Config" 
	//			И Соединение.НомерСоединения <> НомерТекущегоСоединения Тогда
	//			СообщитьОбОшибке("Первоначальное создание узла плана обмена должно выполняться в монопольном режиме!");
	//			Отказ = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	//Если Не ПараметрыСеанса.ИспользованиеРИБ И Ссылка <> ПланыОбмена.Полный.ЭтотУзел() Тогда
	//	Сообщить("Для задействования механизма установки префиксов объектов необходимо перезапустить текущий сеанс работы 1С:Предприятия.");
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриОтправкеДанныхПодчиненному(ЭлементДанных, ОтправкаЭлемента, СозданиеНачальногоОбраза)

//	Тип = ТипЗнч(ЭлементДанных);
//	
//	Сообщить(Строка(Тип)+" "+Строка(ЭлементДанных));
//	
//	Если (Тип <> Тип("СправочникОбъект.РасходыПериода"))
//		И(Тип <> Тип("СправочникОбъект.РасшифровкаРасходовПериода"))
//		И(Тип <> Тип("ПланСчетовОбъект.Хозрасчетный"))
//		И(Тип <> Тип("ПланВидовХарактеристикОбъект.ВидыСубконтоХозрасчетные"))
//		И(Тип <> Тип("ПланВидовХарактеристикОбъект.НастройкиПользователей"))
//		И(Тип <> Тип("СправочникОбъект.ПлатежиВБюджет"))
//		И(Тип <> Тип("СправочникОбъект.СтатьиДвиженияДенежныхСредств"))Тогда   
//		ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
//	КонецЕсли; 
//	
КонецПроцедуры   

Процедура ДополнительныеОграниченияОтправки(Тип, ОтправкаЭлемента)
	//
	//Если Тип = Тип("СправочникОбъект.РасходыПериода") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	//Если Тип = Тип("СправочникОбъект.РасшифровкаРасходовПериода") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	//Если Тип = Тип("СправочникОбъект.ПлатежиВБюджет") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	//Если Тип = Тип("СправочникОбъект.СтатьиДвиженияДенежныхСредств") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	////Если Тип = Тип("СправочникОбъект.Пользователи") Тогда
	////	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	////КонецЕсли;	
	//
	//Если Тип = Тип("ПланСчетовОбъект.Хозрасчетный") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	//Если Тип = Тип("ПланВидовХарактеристикОбъект.ВидыСубконтоХозрасчетные") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
	//Если Тип = Тип("ПланВидовХарактеристикОбъект.НастройкиПользователей") Тогда
	//	ОтправкаЭлемента = ОтправкаЭлементаДанных.Игнорировать;
	//КонецЕсли;	
	//
КонецПроцедуры                       

Процедура ПриОтправкеДанныхГлавному(ЭлементДанных, ОтправкаЭлемента)
	
	//Тип = ТипЗнч(ЭлементДанных);
	//
	//Сообщить(Строка(Тип)+" "+Строка(ЭлементДанных));
	//
	//ДополнительныеОграниченияОтправки(Тип, ОтправкаЭлемента);
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтПодчиненного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)
	//
	//Тип = ТипЗнч(ЭлементДанных);
	//
	//Сообщить(Строка(Тип)+" "+Строка(ЭлементДанных));
	//
	//Если Тип = Тип("ДокументОбъект.ПроводкиПоЗаработнойПлате") Тогда		
	//	
	//	НаборЗаписей = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	//	
	//	НаборЗаписей.Отбор.Регистратор.Установить(ЭлементДанных.Ссылка);
	//	
	//	НаборЗаписей.Прочитать();
	//	
	//	Для каждого Запись Из НаборЗаписей Цикл
	//		Запись.Активность = Истина;
	//	КонецЦикла; 
	//	
	//	НаборЗаписей.Записать();
	//	
	//КонецЕсли; 
	
КонецПроцедуры

Процедура ПриПолученииДанныхОтГлавного(ЭлементДанных, ПолучениеЭлемента, ОтправкаНазад)

	//Тип = ТипЗнч(ЭлементДанных);
	//
	//Сообщить(Строка(Тип)+" "+Строка(ЭлементДанных));
	
КонецПроцедуры
