
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	СведенияОСотруднике=СведенияОСотруднике(Сотрудник,Организация,НачалоПериода);

	д=НачалоПериода;
	Пока д<=КонецПериода Цикл
		
		Расчет=Движения.УчетРабочегоВремени.Добавить();
		Расчет.Организация=Организация;
		Расчет.Сотрудник=Сотрудник;
		
		ЗаполнитьЗначенияСвойств(Расчет,СведенияОСотруднике);
		
		Расчет.СпособОтраженияРасходов=СведенияОСотруднике.СпособОтраженияРасходовБУ;
		Расчет.ПодразделениеОрганизации=СведенияОСотруднике.Подразделение;
		Расчет.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам;
		Расчет.ВидРасчета=ПланыВидовРасчета.РасчетыУчетаРабочегоВремени.Отзыв;
		Расчет.ПериодРегистрации=НачалоМесяца(д);
		Расчет.ПериодДействияНачало=д;
		Расчет.ПериодДействияКонец=КонецДня(мин(КонецМесяца(д),КонецПериода));
		Расчет.Маркер="";
		
		д=КонецМесяца(д)+1;
			
	КонецЦикла;

	
КонецПроцедуры // Печать()
