

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбновитьКлассификаторНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКлассификаторНаСервере()
	
	Макет = РегистрыСведений.КлассификаторЕдиницИзмеренияПоГНК.ПолучитьМакет("Классификатор");
	
	НаборЗаписей = РегистрыСведений.КлассификаторЕдиницИзмеренияПоГНК.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();

	ОбластьКлассификатор = Макет.ПолучитьОбласть("Классификатор");
	
	Для Стр = 2 По ОбластьКлассификатор.ВысотаТаблицы Цикл
		
		Набор = НаборЗаписей.Добавить();
		
		// Код
		ЯчейкаКод = ОбластьКлассификатор.Область(Стр, 1, Стр, 1); 
		Если ЯчейкаКод.СодержитЗначение Тогда
			Набор.Код = ЯчейкаКод.Значение;
		Иначе
			Набор.Код = ЯчейкаКод.Текст;
		КонецЕсли;
		
		// Наименование
		ЯчейкаНаименование = ОбластьКлассификатор.Область(Стр, 2, Стр, 2); 
		Если ЯчейкаНаименование.СодержитЗначение Тогда
			Набор.Наименование = ЯчейкаНаименование.Значение;
		Иначе
			Набор.Наименование = ЯчейкаНаименование.Текст;
		КонецЕсли;
		
		// КраткоеНаименование
		ЯчейкаКраткоеНаименование = ОбластьКлассификатор.Область(Стр, 3, Стр, 3); 
		Если ЯчейкаКраткоеНаименование.СодержитЗначение Тогда
			Набор.КраткоеНаименование = ЯчейкаКраткоеНаименование.Значение;
		Иначе
			Набор.КраткоеНаименование = ЯчейкаКраткоеНаименование.Текст;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();	
	
КонецПроцедуры