
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПТ","Платежное требование");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Функция ПечатьПП(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	Область = Макет.ПолучитьОбласть("ПТ");
	
	Область.Параметры.Номер = Формат(Номер,"ЧГ=0");
	
	Если БанковскийСчет.МесяцПрописью Тогда
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	Иначе
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	КонецЕсли; 	
	
	Область.Параметры.Заполнить(Руководители);
	
	Область.Параметры.ИННКонтрагента = Контрагент.ИНН;
	Область.Параметры.ИНН = Организация.ИНН;
	Область.Параметры.Организация = Организация;
	Область.Параметры.Контрагент = Контрагент;
	
	Область.Параметры.НомерБанковскогоСчета = БанковскийСчет.НомерСчета;
	Область.Параметры.Банк = СокрЛП(БанковскийСчет.Банк.Наименование)+", "+СокрЛП(БанковскийСчет.Банк.Город);
	Область.Параметры.МФОБанка = БанковскийСчет.Банк.Код;
	
	Область.Параметры.НомерБанковскогоСчетаКонтрагента = БанковскийСчетКонтрагента.НомерСчета;
	Область.Параметры.БанкКонтрагента = СокрЛП(БанковскийСчетКонтрагента.Банк.Наименование)+", "+СокрЛП(БанковскийСчетКонтрагента.Банк.Город);
	Область.Параметры.МФОБанкаКонтрагента = БанковскийСчетКонтрагента.Банк.Код;
	
	НДСНаПечать="";
	
	Если УказатьВСодержанииНДС Тогда
		Если СуммаНДС=0 Тогда
			НДСНаПечать="Сумма - "+Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=")+", (без НДС).";	
		Иначе
			НДСНаПечать="Сумма - "+Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
			НДСНаПечать=НДСНаПечать+", в том числе НДС ("+Строка(ПолучитьСтавкуНДС(СтавкаНДС))+" %) - "+Формат(СуммаНДС,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");	
		КонецЕсли; 
	КонецЕсли; 
	
	Область.Параметры.Содержание = Содержание+" "+НДСНаПечать;
	
	
	СуммаНаПечать=Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	СуммаБезТийин=БанковскийСчет.СуммаБезТийин;
	Если СуммаБезТийин и Сумма=Цел(Сумма) Тогда
		СуммаНаПечать=СтрЗаменить(СуммаНаПечать,".00","");
	КонецЕсли; 
	Область.Параметры.Сумма = СуммаНаПечать;
	
	Область.Параметры.СуммаПрописью = ПроцедурыСервера.СформироватьСуммуПрописью_Сервер(Сумма,Константы.ВалютаРегламентированногоУчета.Получить());
	
	ТабДок.Вывести(Область);
	
    ТабДок.ЭкземпляровНаСтранице=2;
	ТабДок.ТолькоПросмотр = Истина;
	
	ТабДок.КлючПараметровПечати="КПП_ПлатежноеТребование";
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьПП(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Плат. треб.");
	
КонецПроцедуры // Печать()

