
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПроцедурыСервера.ЗаполнитьШапкуДокумента_Сервер(Объект, Объект.Ссылка);
		Объект.СтавкаНДС=Перечисления.СтавкиНДС.БезНДС;
		Касса = Объект.Организация.ОсновнаяКасса;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Организация.ТолькоПросмотр = не УчетПоВсемОрганизациям;
	Элементы.Ответственный.ТолькоПросмотр = не ПроцедурыСервера.РольДоступна_Сервер("ПолныеПрава");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Если Строка(Объект.СтавкаНДС)="20%" Тогда
		Элементы.СуммаНДС.Видимость=Истина;
	Иначе
		Элементы.СуммаНДС.Видимость=Ложь;
	КонецЕсли;	
	
КонецПроцедуры


