
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПроцедурыСервера.ЗаполнитьШапкуДокумента_Сервер(Объект, Объект.Ссылка);
		
		
		Руководители = ОтветственныеЛица(Объект.Организация, ТекущаяДата());

		Объект.Руководитель=Руководители.Руководитель;
 		Объект.ГлавныйБухгалтер=Руководители.ГлавныйБухгалтер;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ДатаДействия  = Объект.Дата + 10 * (24 * 60 * 60);

	КонецЕсли;	
	
	Элементы.Организация.ТолькоПросмотр = не УчетПоВсемОрганизациям;
	Элементы.Ответственный.ТолькоПросмотр = не ПроцедурыСервера.РольДоступна_Сервер("ПолныеПрава");
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.ДатаДействия =Объект.Дата + 10 * (24 * 60 * 60);

КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	Объект.НаПолучениеОт = ПолучитьНаименование(Объект.Контрагент);
    ДоговорКонтрагентаПриИзменении("");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНаименование(Контрагент)
	
	Возврат ?(ЗначениеЗаполнено(Контрагент.НаименованиеПолное),Контрагент.НаименованиеПолное,Контрагент.Наименование);

КонецФункции


&НаКлиенте
Процедура ДоговорКонтрагентаПриИзменении(Элемент)
	
	Объект.ПоДокументу =  Строка(Объект.ДоговорКонтрагента);
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ПаспортныеДанныеСотрудника = ПолучитьПаспортныеДанные(Объект.Дата,Объект.Сотрудник);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПаспортныеДанные(Дата,Сотрудник)
	Возврат ПолучитьПаспорныеДанныеСтрокой(Дата,Сотрудник);
КонецФункции


