
// Переменная для хранения текущего пользователя ("Справочник.Пользователи")
Перем глТекущийПользователь Экспорт;
Перем УчетПоВсемОрганизациям Экспорт;
Перем ОсновнаяОрганизация Экспорт;

Процедура ПриНачалеРаботыСистемы()
	
	//ОпределитьТекущегоПользователя();
	
	глТекущийПользователь=ПроцедурыСервера.ПараметрСеанса("ТекущийПользователь");
	
	Если не ЗначениеЗаполнено(глТекущийПользователь) Тогда
		Предупреждение("Пользователь не определен!");
		ЗавершитьРаботуСистемы();
	КонецЕсли;	
	
	ОсновнаяОрганизация    = ПроцедурыСервера.ПолучитьЗначениеПоУмолчанию_Сервер(глТекущийПользователь, "ОсновнаяОрганизация");
	УчетПоВсемОрганизациям = ПроцедурыСервера.ПолучитьЗначениеПоУмолчанию_Сервер(глТекущийПользователь, "УчетПоВсемОрганизациям");

КонецПроцедуры



