
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоРегистрам(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)
	
	Запрос=новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	РаботникиОрганизацийСрезПервых.Сотрудник КАК Сотрудник,
	|	РаботникиОрганизацийСрезПервых.ПодразделениеОрганизации,
	|	РаботникиОрганизацийСрезПервых.Должность,
	|	РаботникиОрганизацийСрезПервых.ТипСотрудника,
	|	РаботникиОрганизацийСрезПервых.Категория,
	|	РаботникиОрганизацийСрезПервых.ТабельныйНомер,
	|	РаботникиОрганизацийСрезПервых.НеРезидент,
	|	РаботникиОрганизацийСрезПервых.Надомник,
	|	РаботникиОрганизацийСрезПервых.НеУдерживатьПрофвзносы,
	|	ДанныеДляРасчетаЗПСрезПоследних.Оклад,
	|	ДанныеДляРасчетаЗПСрезПоследних.ВВалюте,
	|	ДанныеДляРасчетаЗПСрезПоследних.Валюта,
	|	ДанныеДляРасчетаЗПСрезПоследних.Тариф,
	|	ДанныеДляРасчетаЗПСрезПоследних.ФормаТруда,
	|	ДанныеДляРасчетаЗПСрезПоследних.Ставка,
	|	ДанныеДляРасчетаЗПСрезПоследних.Разряд,
	|	ДанныеДляРасчетаЗПСрезПоследних.ГрафикРаботы,
	|	ДанныеДляРасчетаПНСрезПервых.СпособРасчетаПН,
	|	СпособыОтраженияРасходовПоЗПБУСрезПервых.СпособОтраженияРасходов,
	|	""Срез"" КАК ВидЗаписи,
	|	1 КАК ДляСортировки,
	|	ВЫБОР
	|		КОГДА ДатыПриема.ДатаПриема > &НачалоПериода
	|			ТОГДА ДатыПриема.ДатаПриема
	|		ИНАЧЕ &НачалоПериода
	|	КОНЕЦ КАК НачалоПериода,
	|	ВЫБОР
	|		КОГДА ДатыУвольнения.ДатаУвольнения < &КонецПериода
	|			ТОГДА ДатыУвольнения.ДатаУвольнения
	|		ИНАЧЕ &КонецПериода
	|	КОНЕЦ КАК КонецПериода
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(
	|			&ДатаСреза,
	|			Организация = &Организация
	|				И (НЕ Сотрудник В
	|						(ВЫБРАТЬ
	|							РаботникиОрганизаций.Сотрудник
	|						ИЗ
	|							РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|						ГДЕ
	|							РаботникиОрганизаций.Период <= &ДатаСРеза
	|							И РаботникиОрганизаций.Активность
	|							И РаботникиОрганизаций.Организация = &Организация
	|							И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)))) КАК РаботникиОрганизацийСрезПервых
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляРасчетаЗП.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК ДанныеДляРасчетаЗПСрезПоследних
	|		ПО РаботникиОрганизацийСрезПервых.Сотрудник = ДанныеДляРасчетаЗПСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляРасчетаПН.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК ДанныеДляРасчетаПНСрезПервых
	|		ПО РаботникиОрганизацийСрезПервых.Сотрудник = ДанныеДляРасчетаПНСрезПервых.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоЗПБУ.СрезПоследних(&ДатаСреза, Организация = &Организация) КАК СпособыОтраженияРасходовПоЗПБУСрезПервых
	|		ПО РаботникиОрганизацийСрезПервых.Сотрудник = СпособыОтраженияРасходовПоЗПБУСрезПервых.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизаций.Период КАК ДатаПриема
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ГДЕ
	|			РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|			И РаботникиОрганизаций.Организация = &Организация) КАК ДатыПриема
	|		ПО РаботникиОрганизацийСрезПервых.Сотрудник = ДатыПриема.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизаций.Период КАК ДатаУвольнения
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ГДЕ
	|			РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			И РаботникиОрганизаций.Организация = &Организация) КАК ДатыУвольнения
	|		ПО РаботникиОрганизацийСрезПервых.Сотрудник = ДатыУвольнения.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаботникиОрганизаций.Сотрудник,
	|	РаботникиОрганизаций.ПодразделениеОрганизации,
	|	РаботникиОрганизаций.Должность,
	|	РаботникиОрганизаций.ТипСотрудника,
	|	РаботникиОрганизаций.Категория,
	|	РаботникиОрганизаций.ТабельныйНомер,
	|	РаботникиОрганизаций.НеРезидент,
	|	РаботникиОрганизаций.Надомник,
	|	РаботникиОрганизаций.НеУдерживатьПрофвзносы,
	|	ДанныеДляРасчетаЗП.Оклад,
	|	ДанныеДляРасчетаЗП.ВВалюте,
	|	ДанныеДляРасчетаЗП.Валюта,
	|	ДанныеДляРасчетаЗП.Тариф,
	|	ДанныеДляРасчетаЗП.ФормаТруда,
	|	ДанныеДляРасчетаЗП.Ставка,
	|	ДанныеДляРасчетаЗП.Разряд,
	|	ДанныеДляРасчетаЗП.ГрафикРаботы,
	|	ДанныеДляРасчетаПН.СпособРасчетаПН,
	|	СпособыОтраженияРасходовПоЗПБУ.СпособОтраженияРасходов,
	|	""Движение"",
	|	2,
	|	РаботникиОрганизаций.Период,
	|	ВЫБОР
	|		КОГДА ДатыУвольнения.ДатаУвольнения < &КонецПериода
	|			ТОГДА ДатыУвольнения.ДатаУвольнения
	|		ИНАЧЕ &КонецПериода
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляРасчетаЗП КАК ДанныеДляРасчетаЗП
	|		ПО РаботникиОрганизаций.Сотрудник = ДанныеДляРасчетаЗП.Сотрудник
	|			И РаботникиОрганизаций.Регистратор = ДанныеДляРасчетаЗП.Регистратор
	|			И РаботникиОрганизаций.Период = ДанныеДляРасчетаЗП.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляРасчетаПН КАК ДанныеДляРасчетаПН
	|		ПО РаботникиОрганизаций.Сотрудник = ДанныеДляРасчетаПН.Сотрудник
	|			И РаботникиОрганизаций.Регистратор = ДанныеДляРасчетаПН.Регистратор
	|			И РаботникиОрганизаций.Период = ДанныеДляРасчетаПН.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СпособыОтраженияРасходовПоЗПБУ КАК СпособыОтраженияРасходовПоЗПБУ
	|		ПО РаботникиОрганизаций.Сотрудник = СпособыОтраженияРасходовПоЗПБУ.Сотрудник
	|			И РаботникиОрганизаций.Регистратор = СпособыОтраженияРасходовПоЗПБУ.Регистратор
	|			И РаботникиОрганизаций.Период = СпособыОтраженияРасходовПоЗПБУ.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизаций.Период КАК ДатаПриема
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ГДЕ
	|			РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.ПриемНаРаботу)
	|			И РаботникиОрганизаций.Организация = &Организация) КАК ДатыПриема
	|		ПО РаботникиОрганизаций.Сотрудник = ДатыПриема.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			РаботникиОрганизаций.Сотрудник КАК Сотрудник,
	|			РаботникиОрганизаций.Период КАК ДатаУвольнения
	|		ИЗ
	|			РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|		ГДЕ
	|			РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|			И РаботникиОрганизаций.Организация = &Организация) КАК ДатыУвольнения
	|		ПО РаботникиОрганизаций.Сотрудник = ДатыУвольнения.Сотрудник
	|ГДЕ
	|	РаботникиОрганизаций.Организация = &Организация
	|	И РаботникиОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДляРасчетаЗП.Организация = &Организация
	|	И ДанныеДляРасчетаЗП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ДанныеДляРасчетаПН.Организация = &Организация
	|	И ДанныеДляРасчетаПН.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СпособыОтраженияРасходовПоЗПБУ.Организация = &Организация
	|	И СпособыОтраженияРасходовПоЗПБУ.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (НЕ РаботникиОрганизаций.Сотрудник В
	|				(ВЫБРАТЬ
	|					РаботникиОрганизаций.Сотрудник
	|				ИЗ
	|					РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|				ГДЕ
	|					РаботникиОрганизаций.Период <= &ДатаСРеза
	|					И РаботникиОрганизаций.Активность
	|					И РаботникиОрганизаций.Организация = &Организация
	|					И РаботникиОрганизаций.ПричинаИзмененияСостояния = ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)))
	|	И РаботникиОрганизаций.ПричинаИзмененияСостояния <> ЗНАЧЕНИЕ(Перечисление.ПричиныИзмененияСостояния.Увольнение)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Сотрудник,
	|	ДляСортировки,
	|	НачалоПериода,
	|	КонецПериода";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ДатаСреза",НачалоМесяца(дата)-1);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоМесяца(дата));
	Запрос.УстановитьПараметр("КонецПериода",КонецМесяца(дата));
	
	ДвиженияСотрудников=Запрос.Выполнить().Выгрузить();
	
	
	Для н=0 по ДвиженияСотрудников.Количество()-2 Цикл
		
		Строка= ДвиженияСотрудников[н];
		
		НачалоПериода=Строка.НачалоПериода;
		КонецПериода=Строка.КонецПериода;
		
		Строка1 = ДвиженияСотрудников[н+1];
		Если Строка.Сотрудник=Строка1.Сотрудник Тогда			
			Если НачалоДня(Строка.НачалоПериода)=НачалоДня(Строка1.НачалоПериода) Тогда
				Если НачалоДня(Строка.КонецПериода)=НачалоДня(Строка1.КонецПериода) Тогда
					Продолжить;
				КонецЕсли; 
			КонецЕсли; 
			КонецПериода=мин(Строка1.НачалоПериода-1,Строка.КонецПериода,Строка1.КонецПериода);
		КонецЕсли;	
		
		ДобавитьДвижение(Строка,НачалоПериода,КонецПериода);		
		
	КонецЦикла;	
	
	Строка= ДвиженияСотрудников[ДвиженияСотрудников.Количество()-1];
	ДобавитьДвижение(Строка,Строка.НачалоПериода,Строка.КонецПериода);		
	
КонецПроцедуры // Печать()

Процедура ДобавитьДвижение(Строка,НачалоПериода,КонецПериода)
	
	Движение=Движения.УчетРабочегоВремени.Добавить();
	Движение.ПериодРегистрации=НачалоМесяца(дата);
	Движение.Организация=Организация;
	Движение.ПериодДействияНачало=НачалоПериода;
	Движение.ПериодДействияКонец=КонецДня(КонецПериода);
	Движение.ВидРасчета=ПланыВидовРасчета.РасчетыУчетаРабочегоВремени.РабочееВремя;
	Движение.ВидУчетаВремени=Перечисления.ВидыУчетаВремени.ПоЧасам;
	
	ЗаполнитьЗначенияСвойств(Движение,Строка);
	
КонецПроцедуры	

