
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаПоДокументу = Номенклатура.Итог("Сумма")+Номенклатура.Итог("СуммаНДС");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок, СтруктураШапкиДокумента)
	
	ПроводкиБУ = Движения.Хозрасчетный;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВозвратОтДилеровНоменклатура.Номенклатура,
	|	СУММА(ВозвратОтДилеровНоменклатура.Количество) КАК Количество,
	|	СУММА(ВозвратОтДилеровНоменклатура.Сумма) КАК Сумма,
	|	ВозвратОтДилеровНоменклатура.СтавкаНДС,
	|	СУММА(ВозвратОтДилеровНоменклатура.СуммаНДС) КАК СуммаНДС
	|ИЗ
	|	Документ.ВозвратОтДилеров.Номенклатура КАК ВозвратОтДилеровНоменклатура
	|ГДЕ
	|	ВозвратОтДилеровНоменклатура.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратОтДилеровНоменклатура.Номенклатура,
	|	ВозвратОтДилеровНоменклатура.СтавкаНДС";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		//
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание = "";     
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("2910");
		УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,Выборка.Номенклатура);
		УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,Склад);
		
		Если Проводка.СчетДт.Количественный Тогда
			Проводка.КоличествоДт = Выборка.Количество;
		КонецЕсли; 
		
		Проводка.СчетКт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("9120");
		
		Проводка.Сумма = Выборка.Сумма; 
		
		////
		//Проводка = ПроводкиБУ.Добавить();
		//Проводка.Период      = Дата;
		//Проводка.Организация = Организация;
		//Проводка.Содержание = "";     
		//
		//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("9120");
		//
		//Проводка.СчетКт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("9910");
		//
		//Проводка.Сумма = Выборка.Сумма; 
		
		//
		Проводка = ПроводкиБУ.Добавить();
		Проводка.Период      = Дата;
		Проводка.Организация = Организация;
		Проводка.Содержание = "";     
		
		Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("9040");
		УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,Выборка.Номенклатура);
		
		Проводка.СчетКт     =  СчетУчетаРасчетовСКонтрагентомБУ;//ПланыСчетов.Хозрасчетный.НайтиПоКоду("4012");
		УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Контрагент);
		УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,ДоговорКонтрагента);
		
		Проводка.Сумма = Выборка.Сумма; 
		
		//
		Если Выборка.СуммаНДС<>0 Тогда
			
			Проводка = ПроводкиБУ.Добавить();
			Проводка.Период      = Дата;
			Проводка.Организация = Организация;
			Проводка.Содержание = "";     
			
			Проводка.СчетДт      = СчетУчетаПлатежа("НДС");
			УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,Справочники.ПлатежиВБюджет.НДС);
			
			Проводка.СчетКт     = СчетУчетаРасчетовСКонтрагентомБУ;// ПланыСчетов.Хозрасчетный.НайтиПоКоду("4012");
			УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Контрагент);
			УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,ДоговорКонтрагента);
			
			Проводка.Сумма = Выборка.СуммаНДС; 
			
		КонецЕсли; 
		
		////
		//Проводка = ПроводкиБУ.Добавить();
		//Проводка.Период      = Дата;
		//Проводка.Организация = Организация;
		//Проводка.Содержание = "";     
		//
		//Проводка.СчетДт      = ПланыСчетов.Хозрасчетный.НайтиПоКоду("9910");
		//
		//Проводка.СчетКт     =  ПланыСчетов.Хозрасчетный.НайтиПоКоду("9040");
		//УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,Выборка.Номенклатура);
		//
		//Проводка.Сумма = Выборка.Сумма; 
		//
		
	КонецЦикла;
	 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	//СуммаПоДокументу = Номенклатура.Итог("Сумма")+Номенклатура.Итог("СуммаНДС");	
	
КонецПроцедуры
 