
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ЗаявлениеНаАккредитив","Заявление на аккредитив");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
КонецПроцедуры

Функция ПечатьППвалютное()
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЗаявлениеНаАккредитив");
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	Область = Макет.ПолучитьОбласть("Аккредитив1");
	
	Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	Если БанковскийСчет.МесяцПрописью Тогда
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	Иначе
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	КонецЕсли; 	
	
	Область.Параметры.Заполнить(Руководители);
	Область.Параметры.Организация=СокрЛП(Организация);
	Область.Параметры.ОписаниеОрганизации = СокрЛП(ОписаниеОрганизации);
	Область.Параметры.ОписаниеБенефициара=СокрЛП(ОписаниеБенефициара);
	
	Если Телеграф Тогда
		Область.Параметры.Телеграф="Х";
	Иначе 
		Область.Параметры.Телеграф=" ";
	КонецЕсли;	
	
	Если Воздух Тогда
		Область.Параметры.Воздух="Х";
	Иначе
		Область.Параметры.Воздух=" ";
	КонецЕсли;	
	
	Если Безотзывной Тогда
		Область.Параметры.Безотзывной="Х";
	Иначе 
		Область.Параметры.Безотзывной=" ";
	КонецЕсли;	
	
	Если Трансферабельный Тогда
		Область.Параметры.Трансферабельный="Х";
	Иначе 
		Область.Параметры.Трансферабельный=" ";
	КонецЕсли;	
	
	Если Делимый Тогда
		Область.Параметры.Делимый="Х";
	Иначе 
		Область.Параметры.Делимый=" ";
	КонецЕсли;
	
	Если Подтвержденный Тогда
		Область.Параметры.Подтвержденный="Х";
	Иначе 
		Область.Параметры.Подтвержденный=" ";
	КонецЕсли;	
	
	Если ЧастичныеОтгрузки Тогда
		Область.Параметры.ОтгрузкиРазрешено="Х";
		Область.Параметры.ОтгрузкиНеРазрешено=" ";
	Иначе
		Область.Параметры.ОтгрузкиРазрешено=" ";
		Область.Параметры.ОтгрузкиНеРазрешено="Х";
	КонецЕсли;
	
	Если Перегрузка Тогда
		Область.Параметры.ПерегрузкаРазрешено="Х";
		Область.Параметры.ПерегрузкаНеРазрешено=" ";
	Иначе
		Область.Параметры.ПерегрузкаРазрешено=" ";
		Область.Параметры.ПерегрузкаНеРазрешено="Х";
	КонецЕсли;
	
	Область.Параметры.ДнейАккредитива=СрокАккредитива;
	Область.Параметры.Сумма = Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	Область.Параметры.Валюта=Валюта;
	Область.Параметры.СуммаПрописью = СформироватьСуммуПрописью(Сумма,Валюта);
	
	Область.Параметры.ОтгрузочныеРеквизиты=СокрЛП(ОтгрузочныеРеквизиты);
	Область.Параметры.ОписаниеТранспортировки=СокрЛП(ОписаниеТранспортировки);
	Область.Параметры.ОписаниеПоставки=СокрЛП(ОписаниеПоставки);
	
	ТабДок.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого СтрокаПереченьДокументов из ПереченьДокументов  Цикл
		Область.Параметры.Заполнить(СтрокаПереченьДокументов);
		Область.Параметры.ОписаниеДокумента=СокрЛП(СтрокаПереченьДокументов.Описание);
		ТабДок.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("Аккредитив2");
	Область.Параметры.ПаспортИмпортнойСделки=СокрЛП(ПаспортИмпортнойСделки);
	Область.Параметры.ДатаПервойОтгрузки=Формат(ДатаПервойОтгрузки,"ДФ=dd.MM.yyyy");;
	Область.Параметры.ДнейДоПоследнейОтгрузки=ДнейДоПоследнейОтгрузки;
	Область.Параметры.СрокПредставленияДокументов=СрокПредставленияДокументов;
	Область.Параметры.ОписаниеСчетаКомиссии=СокрЛП(СчетДляКомиссии);
	Область.Параметры.ОписаниеСчетаПокрытияАккредитива=СокрЛП(СчетДляПокрытияАккредитива);

	Область.Параметры.Заполнить(Руководители);
	ТабДок.Вывести(Область);
	
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьППвалютное();
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Плат. пор.валютное");
	
КонецПроцедуры // Печать()

