
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента);
	
КонецПроцедуры

Процедура ДвиженияПоБУ(Режим, Отказ, Заголовок,СтруктураШапкиДокумента)

	Для Каждого ТекСтрокаГотоваяПродукция Из ГотоваяПродукция Цикл
		// регистр Хозрасчетный 
		Проводка = Движения.Хозрасчетный.Добавить();
		Проводка.Организация = Организация;
		Проводка.Период = Дата;
		
		Проводка.СчетДт = ТекСтрокаГотоваяПродукция.СчетУчета;
		УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,1,ТекСтрокаГотоваяПродукция.Номенклатура);
		УстановитьСубконто(Проводка.СчетДт,Проводка.СубконтоДт,2,ТекСтрокаГотоваяПродукция.Склад);
		
		Проводка.СчетКт = ТекСтрокаГотоваяПродукция.СчетПрозводства;
		УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,1,ТекСтрокаГотоваяПродукция.Цех);
		УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,2,Справочники.СтатьиЗатрат.Выпуск);
		УстановитьСубконто(Проводка.СчетКт,Проводка.СубконтоКт,3,ТекСтрокаГотоваяПродукция.Номенклатура);
		
		Проводка.Сумма = ТекСтрокаГотоваяПродукция.Сумма;
		Проводка.КоличествоДт = ТекСтрокаГотоваяПродукция.Количество;
		Проводка.КоличествоКт = ТекСтрокаГотоваяПродукция.Количество;
		
	КонецЦикла;
	
КонецПроцедуры
 

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

