
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("СтатьяЗатрат") Тогда
		СтандартнаяОбработка=Ложь;
		ТекОтбор = Список.Отбор;
		НовоеУсловиеОтбора = ТекОтбор.Элементы.Добавить(тип("ЭлементОтбораКомпоновкиДанных"));
		НовоеУсловиеОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СтатьяЗатрат");
		НовоеУсловиеОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		НовоеУсловиеОтбора.ПравоеЗначение = ЭтаФорма.Параметры.СтатьяЗатрат;
		НовоеУсловиеОтбора.Использование  = истина;
		НовоеУсловиеОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
КонецПроцедуры
