
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заголовок", Заголовок);
	Параметры.Свойство("ИмяДинамическогоСписка", ИмяДинамическогоСписка);
	
	КомпоновщикНастроек.Инициализировать(Параметры.ИсточникДоступныхНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.Настройки);
	КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Параметры.ПользовательскиеНастройки);
	КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(Параметры.ФиксированныеНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИмяДинамическогоСписка", ИмяДинамическогоСписка);
	СтруктураПараметров.Вставить("ИсточникДоступныхНастроек", КомпоновщикНастроек.ПолучитьИсточникДоступныхНастроек());
	СтруктураПараметров.Вставить("Настройки", КомпоновщикНастроек.Настройки);
	СтруктураПараметров.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки);
	СтруктураПараметров.Вставить("ФиксированныеНастройки", КомпоновщикНастроек.ФиксированныеНастройки);
	
	Оповестить("ИзменениеНастроекДинамическогоСпискаТекущиеДелаЭДО", СтруктураПараметров);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры
