
Процедура ДокументыПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РольДоступна("РедактированиеЧужихДокументов") 
		или РольДоступна("ПолныеПрава") Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    //DimaB
	//Если Источник.Ответственный<>глТекущийПользователь Тогда 
	Если Источник.Ответственный<>ПараметрыСеанса.ТекущийПользователь Тогда
		Сообщить("Нет прав на редактирование чужих документов!",СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
