
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	Для каждого СтрокаРегистра Из ЭтотОбъект Цикл 
		Если СтрокаРегистра.НеВычетаемыеРасходыВключаемыеНОБ Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения3");
		КонецЕсли;	
		
		Если СтрокаРегистра.НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения4");
		КонецЕсли;
		
		Если СтрокаРегистра.УменьшениеНОБ Тогда 
			ПроверяемыеРеквизиты.добавить("СтрокаПриложения7");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
