
Функция ZFI_011_RFC_OZBEKISTAN_RTRN(ВыделенныеСтроки=Неопределено) Экспорт
	ИмяWSСсылки	= "ZFI_011_FG_1C";
	WSСервис	= WSСервисПолучить();
	WSПрокси	= WSПроксиПолучить(WSСервис);
	WSТип		= WSПрокси.ФабрикаXDTO.Тип(URIПространстваИменПолучить(WSСервис), "ZFI_011_S_1C_LOG");
	WSПараметр	= WSПрокси.ФабрикаXDTO.Создать(WSТип);

	Загружено	= Новый Массив;
	Шерлок		= Новый Структура("DOCNO,PERIOD_YEAR,POSTDATE");
	Для Каждого ТекЭлемент Из ВыделенныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(Шерлок, ZFI_011_S_DATA.Получить(ТекЭлемент));
		//POSTDATE	= Новый ОписаниеТипов("Дата",,,,, Новый КвалификаторыДаты(ЧастиДаты.Дата));
		//Шерлок.POSTDATE	= POSTDATE.ПривестиЗначение(СтрокаКакДата(Шерлок.POSTDATE));
		Если Загружено.Найти(Шерлок) = Неопределено Тогда
			Попытка
				ЗаполнитьЗначенияСвойств(WSПараметр, Шерлок);
				Объект		= WSПрокси.ZFI_011_RFC_OZBEKISTAN_RTRN(WSПараметр);
			Исключение
				Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
				Прервать;
			КонецПопытки;
			Загружено.Добавить(Шерлок);
		КонецЕсли;
	КонецЦикла;
	Возврат (Загружено.Количество() > 0);
КонецФункции

Функция ZFI_011_RFC_OZBEKISTAN_RTRN_TEST() Экспорт
	Ответ		= "";
	ИмяWSСсылки	= "ZFI_011_FG_1C";
	WSСервис	= WSСервисПолучить();
	WSПрокси	= WSПроксиПолучить(WSСервис);
	WSТип		= WSПрокси.ФабрикаXDTO.Тип(URIПространстваИменПолучить(WSСервис), "ZFI_011_S_1C_LOG");
	WSПараметр	= WSПрокси.ФабрикаXDTO.Создать(WSТип);
	Попытка
		Объект		= WSПрокси.ZFI_011_RFC_OZBEKISTAN_RTRN(WSПараметр);
		//Если ТипЗнч(Объект) = Тип("ОбъектXDTO") Тогда
			Для Каждого ТекЭлемент Из Объект.Свойства() Цикл
				Ответ = Ответ + ТекЭлемент.Имя + "		" + Объект.Получить(ТекЭлемент.Имя) + Символы.ВК;
			КонецЦикла;
		//КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
	Возврат Ответ;
КонецФункции

Процедура ZFI_011_RFC_OZBEKISTAN(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZFI_011_FG_1C;
	КонецЕсли;
	ТЧ.Очистить();
	
	ИмяWSСсылки	= "ZFI_011_FG_1C";
	WSПрокси	= WSПроксиПолучить();
	Попытка
		Объект	= WSПрокси.ZFI_011_RFC_OZBEKISTAN();
		Для Каждого ТекСтрока Из Объект.DATA.item Цикл
			НовСтрока = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			НовСтрока.POSTDATE	= СтрокаКакДата(ТекСтрока.POSTDATE);
			НовСтрока.DOCDATE	= СтрокаКакДата(ТекСтрока.DOCDATE);
		КонецЦикла;
		ТЧ.Сортировать("DOCDATE,DOCNO,POSTITEMFORLEDGER");
		
		Если НЕ ПустаяСтрока(Объект.RETURN.MSGV1) Тогда
			Сообщить(Объект.RETURN.MSGV1);
		КонецЕсли;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецПроцедуры

Функция СтрокаКакДата(Знач Слово)
	Ответ		= Дата(1,1,1);
	Попытка
		Ответ		= Дата(СтрЗаменить(Слово, "-", ""));
	Исключение КонецПопытки;
	//Если Год(Ответ) < 2 Тогда
	//	Разделитель	= "-";
	//	Слова 		= СтрРазделить(Слово, Разделитель, Ложь);
	//	Если Слова.Количество() > 2 Тогда
	//		Попытка
	//			Ответ	= Дата(Слова.Получить(0), Слова.Получить(1), Слова.Получить(2));
	//		Исключение КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция WSПроксиПолучить(WSСервис=Неопределено, ИндексТочкиПодключения=0) Экспорт
	Если WSСервис = Неопределено Тогда
		WSСервис = WSСервисПолучить();
	КонецЕсли;
	Точка		= WSСервис.ТочкиПодключения.Получить(ИндексТочкиПодключения);
	//Если ЗащищенноеСоединение Тогда
	//	WSПрокси	= WSСсылки.ZFI_011_FG_1C.СоздатьWSПрокси(WSСервис.URIПространстваИмен, WSСервис.Имя, Точка.Имя,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL, Точка.Местоположение);
	//Иначе
		WSПрокси	= WSСсылки[ИмяWSСсылки].СоздатьWSПрокси(WSСервис.URIПространстваИмен, WSСервис.Имя, Точка.Имя,, Таймаут,, Точка.Местоположение);
	//КонецЕсли;
	НастройкиПолучить(WSПрокси);
	Возврат WSПрокси;
КонецФункции

Функция WSСервисПолучить(ИндексСервиса=0) Экспорт
	WSОпределение	= WSОпределениеПолучить();
	WSСервис		= WSОпределение.Сервисы.Получить(ИндексСервиса);
	Возврат WSСервис;
КонецФункции

Функция WSОпределениеПолучить() Экспорт
	Возврат WSСсылки[ИмяWSСсылки].ПолучитьWSОпределения();
КонецФункции

Функция НастройкиПолучить(Объект=Неопределено)
	//Пользователь	= "d_retmind";
	Пользователь	= "isretmind";
	Пароль			= "Sap1234!";
	Если Объект <> Неопределено Тогда
		Объект.Пользователь	= Пользователь;
		Объект.Пароль		= Пароль;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция URIПространстваИменПолучить(WSСервис=Неопределено)
	Если WSСервис = Неопределено Тогда
		WSСервис = WSСервисПолучить();
	КонецЕсли;
	Возврат WSСервис.URIПространстваИмен;
КонецФункции

Функция Запросить(Адрес) Экспорт
	Ответ	= "";
	Сервер		= СерверПолучить(Адрес);
	Если НЕ ПустаяСтрока(Сервер) И НастройкиПолучить() Тогда
		HTTPСоединение = HTTPСоединениеПолучить(Сервер);
		HTTPЗапрос	= Новый HTTPЗапрос(Адрес, ЗаголовкиПолучить());
		HTTPОтвет	= HTTPСоединение.Получить(HTTPЗапрос);			// 		GET
		Если HTTPОтвет.КодСостояния = 200 Тогда
			Ответ	= HTTPЗапрос.ПолучитьТелоКакСтроку();
			//ЭлектронноеВзаимодействиеССерверомDidox.ПрочитатьСтрокуJSON(
		//ИначеЕсли HTTPОтвет.КодСостояния >= 400 Тогда
		//	HTTPОтвет	= HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);			// 		POST
		//	Если HTTPОтвет.КодСостояния = 200 Тогда
		//		Ответ	= HTTPЗапрос.ПолучитьТелоКакСтроку();
		//	Иначе
		//		Ответ	= Строка(HTTPОтвет.КодСостояния) + " " + Адрес;
		//	КонецЕсли;
				
		Иначе
			Ответ	= Строка(HTTPОтвет.КодСостояния) + " " + Адрес;
		КонецЕсли;
	КонецЕсли;
	Возврат ?(Ответ=Неопределено, "", Ответ);
КонецФункции

Функция WSОпределенияПолучить(УРЛ)
	Попытка
		Если ЗащищенноеСоединение Тогда
			WSОпределения	= Новый WSОпределения(УРЛ, Пользователь, Пароль,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
		Иначе
			WSОпределения	= Новый WSОпределения(УРЛ, Пользователь, Пароль,, Таймаут);
		КонецЕсли;
	Исключение
		Возврат ОписаниеОшибки();
	КонецПопытки;
	Возврат WSОпределения;
КонецФункции

Функция HTTPСоединениеПолучить(Сервер, Порт=8000)
	Если ЗащищенноеСоединение Тогда
		HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль,, Таймаут, Новый ЗащищенноеСоединениеOpenSSL);
	Иначе
		HTTPСоединение = Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль,, Таймаут);
	КонецЕсли;
	Возврат HTTPСоединение;
КонецФункции

Функция ЗаголовкиПолучить()
	Ответ	= Новый Соответствие;
	Ответ.Вставить("Accept-Encoding",	"gzip,deflate");
	Ответ.Вставить("Accept",			"*/*");
	Ответ.Вставить("Connection",		"keep-alive");
	Ответ.Вставить("content-type",		"application/json");
	//Ответ.Вставить("content-type",	"text/html");
	//Ответ.Вставить("charset",		"utf-8");
	//Ответ.Вставить("sap-server",	"true");
	Ответ.Вставить("sap-client",	"200");
	Возврат Ответ;
КонецФункции

Процедура ZSD_010_RFC_OZB_IADE_TES(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZSD_010_S_DATA;
	КонецЕсли;
	ТЧ.Очистить();
	
	ИмяWSСсылки	= "ZSD_010_FG_1C";
	WSПрокси	= WSПроксиПолучить();
	Попытка
		Объект	= WSПрокси.ZSD_010_RFC_OZB_IADE_TES();
		Для Каждого ТекСтрока Из Объект.DATA.item Цикл
			НовСтрока = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			НовСтрока.CRDATE	= СтрокаКакДата(ТекСтрока.CRDATE);
			НовСтрока.GMDATE	= СтрокаКакДата(ТекСтрока.GMDATE);
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецПроцедуры

Процедура ZSD_010_RFC_OZB_FAT_IA_DEKONT(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZSD_011_S_DATA;
	КонецЕсли;
	ТЧ.Очистить();
	
	ИмяWSСсылки	= "ZSD_011_FG_1C";
	WSПрокси	= WSПроксиПолучить();
	Попытка
		Объект	= WSПрокси.ZSD_010_RFC_OZB_FAT_IA_DEKONT();
		Для Каждого ТекСтрока Из Объект.DATA.item Цикл
			НовСтрока = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			НовСтрока.BILLDATE	= СтрокаКакДата(ТекСтрока.BILLDATE);
		КонецЦикла;
		ТЧ.Сортировать("BILLDOC,ITEMNO");
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецПроцедуры

Процедура ZMM_000_FM_1C_FATURA_LISTESI(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZMM_000_S_1C_ENTEGRASYON_LIST;
	КонецЕсли;
	ТЧ.Очистить();
	
	ИмяWSСсылки	= "ZMM_000_FG_1C";
	WSСервис	= WSСервисПолучить();
	WSПрокси	= WSПроксиПолучить(WSСервис);
	URIПространстваИмен	= URIПространстваИменПолучить(WSСервис);
	//WSПараметр	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "MRMRBBW_RANGE_BELNR"));
	//WSПараметр.SIGN		= "1";
	//WSПараметр.OPTION	= "22";
	//WSПараметр.LOW		= "1000000000";
	//WSПараметр.HIGH		= "2000000000";
	//WSПараметр1	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "MRMRBBW_RANGE_BELNR_T"));
	//WSПараметр1.item.Добавить(WSПараметр);
	//MRMRBBW_RANGE_BELNR
	//WSПараметр2	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "TRGR_POSTING_DATE"));
	//WSПараметр3	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "char4"));
	WSПараметр3	= "UZ10";
	//WSПараметр4	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "numeric4"));
	WSПараметр4	= 2021;
	Попытка
		//Объект	= WSПрокси.ZMM_000_FM_1C_FATURA_LISTESI(WSПараметр1, WSПараметр2, WSПараметр3, WSПараметр4);
		//Для Каждого ТекСтрока Из Объект.item Цикл
		//	НовСтрока = ТЧ.Добавить();
		//	ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		//КонецЦикла;
		Объект	= WSПрокси.ZMM_000_FM_1C_FATURA_LISTESI(,, WSПараметр3, WSПараметр4);
		Для Каждого ТекСтрока Из Объект.item Цикл
			НовСтрока = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
			НовСтрока.KAYIT_TARIH	= СтрокаКакДата(ТекСтрока.KAYIT_TARIH);
			НовСтрока.SKT			= СтрокаКакДата(ТекСтрока.SKT);
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецПроцедуры

Процедура ZMM_000_FM_1C_MAL_HAREKETI(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZMM_000_S_1C_ILAC_ALIM;
	КонецЕсли;
	ТЧ.Очистить();
	
	ИмяWSСсылки	= "ZMM_000_FG_1C";
	WSСервис	= WSСервисПолучить();
	WSПрокси	= WSПроксиПолучить(WSСервис);
	URIПространстваИмен	= URIПространстваИменПолучить(WSСервис);
	WSТип		= WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "BKK_R_BUDAT");
	WSПараметр1	= WSПрокси.ФабрикаXDTO.Создать(WSТип);
	WSПараметр2	= WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "CFB_T_MBLNR_RANGE"));
	WSПараметр3	= 2021;	//WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "numeric4"));
	WSПараметр4	= "";	//WSПрокси.ФабрикаXDTO.Создать(WSПрокси.ФабрикаXDTO.Тип(URIПространстваИмен, "char4"));
	Попытка
		Объект	= WSПрокси.ZMM_000_FM_1C_MAL_HAREKETI(WSПараметр1, WSПараметр2, WSПараметр3, WSПараметр4);
		Для Каждого ТекСтрока Из Объект.item Цикл
			НовСтрока = ТЧ.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, ТекСтрока);
		КонецЦикла;
	Исключение
		Сообщить(ОписаниеОшибки(), СтатусСообщения.ОченьВажное);
	КонецПопытки;
КонецПроцедуры

Функция СерверПолучить(Знач Адрес)
	Ответ	= "";
	Если НРег(Лев(Адрес, 7)) = "http://" Тогда
		Адрес	= Сред(Адрес, 8);
	КонецЕсли;
	Для Итератор = 1 По СтрДлина(Адрес) Цикл
		Если Сред(Адрес, Итератор, 1) = "/"  Тогда
			Прервать;
		Иначе
			Ответ	= Ответ + Сред(Адрес, Итератор, 1);
		КонецЕсли;
	КонецЦикла;
	Если Найти(Ответ, ".") = 0 Тогда
		Ответ	= СерверДефолт();
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СерверДефолт()
	ИмяСервера	= "AFERPAEQA1.asfarma.local";
	Возврат ИмяСервера;
КонецФункции

Функция Настроить(Объект) Экспорт
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Организация,
		|	Настройки.Пользователь КАК Ответственный
		|ИЗ
		|	РегистрСведений.НастройкиПользователей КАК Настройки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО Настройки.Значение = Организации.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Настройки.Пользователь = Пользователи.Ссылка
		|ГДЕ
		|	Пользователи.Наименование = &Наименование
		|	И Организации.ПометкаУдаления = ЛОЖЬ
		|	И Организации.ГоловнаяОрганизация.ПометкаУдаления ЕСТЬ NULL");
		Запрос.УстановитьПараметр("Наименование",	"Администратор");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Объект, Выборка);
		КонецЕсли;
		Объект.НацВалюта	= НацВалюта();
		Объект.ИмяСервера	= СерверДефолт();
	КонецЕсли;
	Возврат ЗначениеЗаполнено(Объект.Организация);
КонецФункции

Процедура ПоступленияНоменклатурыСоздать(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZMM_000_S_1C_ENTEGRASYON_LIST;
	КонецЕсли;
	ТЧ.Сортировать("MUHASEBE_BELGE_NO,MUHASEBE_BELGE_KALEM");
	
	Настроить(ЭтотОбъект);
	мДоки	= Новый Массив;
	Для Каждого ТекСтрока Из ТЧ Цикл
		Если мДоки.Найти(ТекСтрока.MUHASEBE_BELGE_NO) = Неопределено Тогда
			Если ДокументПоступленияСуществует(ТекСтрока) Тогда
				//Документ = ДокументНайти(ТекСтрока);
				//Если НЕ Документ.Проведен Тогда
				//	Строки = ТЧ.НайтиСтроки(Новый Структура("MUHASEBE_BELGE_NO", ТекСтрока.MUHASEBE_BELGE_NO));
				//	ПоступлениеНоменклатурыСоздать(ТекСтрока, Строки, Документ);
				//КонецЕсли;
			Иначе
				Строки = ТЧ.НайтиСтроки(Новый Структура("MUHASEBE_BELGE_NO", ТекСтрока.MUHASEBE_BELGE_NO));
				//Если ЭтоНацВалюта(ТекСтрока.PARA_BIRIMI) Тогда
				//	ПоступлениеНоменклатурыСоздать(ТекСтрока, Строки);
				////Иначе
					ПоступлениеНоменклатурыВалютныйСоздать(ТекСтрока, Строки);
				//КонецЕсли;
				//
				//Прервать;
			КонецЕсли;
			
			мДоки.Добавить(ТекСтрока.MUHASEBE_BELGE_NO);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЭтоНацВалюта(Код)
	Возврат (СтрСравнить(Код, "UZS") = 0);
КонецФункции

Процедура ПоступлениеНоменклатурыВалютныйСоздать(Шапка, Детали)
	Ошибки		= Новый Массив;
	Ссылка		= ПоступлениеНоменклатурыПродажВалютныйСпискамиНайти(Шапка);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Док = Ссылка.ПолучитьОбъект();
		Если Док.ПометкаУдаления Тогда Док.УстановитьПометкуУдаления(Ложь); КонецЕсли;
		Док.Номенклатура.Очистить();
		Док.Списки.Очистить();
		Док.РасходыВключаемыеВСтоимость.Очистить();
		Док.Прочее.Очистить();
		Док.ПрямыеЗатраты.Очистить();
	Иначе
		Док = Документы.ПоступлениеНоменклатурыПродажВалютныйСписками.СоздатьДокумент();
		Док.Дата			= Шапка.KAYIT_TARIH;
		Док.Номер			= Шапка.MUHASEBE_BELGE_NO;
		Док.Организация		= Организация;
		Док.ОтражатьПоБУ	= Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Валюта) Тогда
		Док.Валюта			= ВалютаПолучить(Шапка.PARA_BIRIMI);
		Док.Курс			= КурсПолучить(Док.Валюта, Док.Дата);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Склад) Тогда
		Док.Склад			= СкладПолучить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Поставщик) Тогда
		Док.Поставщик		= КонтрагентПолучить(Шапка.SATICI, Шапка.SATICI_TX);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Поставщик) Тогда
		Ошибки.Добавить(СтрШаблон("Не найден Поставщик %2 по коду %1", Шапка.SATICI, Шапка.SATICI_TX));
		ДокументЗаполнить(Док);		// 4testonly
	ИначеЕсли НЕ ЗначениеЗаполнено(Док.ДоговорПоставщика) Тогда
		Док.ДоговорПоставщика				= ДоговорПоставщикаПолучить(Док.Поставщик);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.ДоговорПоставщика) Тогда
		Ошибки.Добавить("Не найден договор поставщика");
	КонецЕсли;
	Док.СчетУчетаРасчетовСКонтрагентом	= СчетУчетаРасчетовСКонтрагентом();
	Док.ПриходныйДокумент				= Шапка.SATINALMA_SIPARIS;
	//Док.ПриходныйДокументДата
	//Док.ЗаписыватьЦеныВСправочник			= Истина;
	//Док.НомерГТД		= Шапка.TESLIMAT;
	//Док.ДатаГТД			=
	//Док.НДСТаможенный	=
	//Док.СчетУчетаРасчетовСТаможней			=
	//Док.СубконтоТаможня1=
	//Док.СубконтоТаможня2=
	//Док.СубконтоТаможня3=
	//Док.ЗачестьАванс	= Истина;
	//Док.ТипРаспределения= Истина;
	
	СчетУчетаБУ			= СчетУчетаНайти();
	Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		Ошибки.Добавить("Не заполнен Счет учета БУ");
	КонецЕсли;
	
	Док.СуммаПоДокументу= 0;
	Для Каждого Деталь Из Детали Цикл
		Если ПустаяСтрока(Деталь.MASRAF_TIPI) Тогда
			ТекСтрока = Док.Номенклатура.Добавить();
			ТекСтрока.Номенклатура	= НоменклатураПродажПодобрать(Деталь.MALZEME, Деталь.PARTI, ?(ЭтоНацВалюта(Шапка.PARA_BIRIMI), Док.Поставщик.Наименование, ""));
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				Возврат;
			КонецЕсли;
			ТекСтрока.НоменклатурныйНомер	= Деталь.MALZEME;
			Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				Ошибки.Добавить(СтрШаблон("Строка %1. Не найдена Номенклатура по коду %2", ТекСтрока.НомерСтроки, Деталь.MALZEME));
			КонецЕсли;
			ТекСтрока.СчетУчетаБУ	= СчетУчетаБУ;
			ТекСтрока.Количество	= Деталь.MIKTAR;
			ТекСтрока.ЦенаВВалюте	= Деталь.BIRIM_FIYAT;
			ТекСтрока.Цена			= Деталь.BIRIM_FIYAT * Док.Курс;
			//ТекСтрока.БазоваяЦена	= Деталь.;
			ТекСтрока.СуммаВВалюте	= Деталь.MIKTAR * Деталь.BIRIM_FIYAT;
			ТекСтрока.Сумма			= Деталь.MIKTAR * ТекСтрока.Цена;			//	Деталь.TUTAR
			ТекСтрока.Список		= СпискиПоступленияНоменклатурыВВалютеПодобрать(ТекСтрока, Деталь);
			ТекСтрока.СрокГодности	= Деталь.SKT;

			Док.СуммаПоДокументу	= Док.СуммаПоДокументу + ТекСтрока.Сумма;
			
			ТекСписки	= Док.Списки.Добавить();
			ТекСписки.Список		= ТекСтрока.Список;
			ТекСписки.ТП			= Деталь.VERGI_TUTAR;
			ТекСписки.ТПСчет		= ПланыСчетов.Хозрасчетный.НайтиПоКоду("4890");
			
		Иначе
			ТекСтрока	= Док.РасходыВключаемыеВСтоимость.Добавить();
			ТекСтрока.ПриходныйДокумент	= Шапка.FATURA_BELGE_NO + "/" + Шапка.FATURA_NO;
			ТекСтрока.Описание		= Деталь.MASRAF_TIPI_TX;
			ТекСтрока.Валюта		= Док.Валюта;
			ТекСтрока.ВалютнаяСумма	= Деталь.MIKTAR * Деталь.BIRIM_FIYAT;
			ТекСтрока.СтавкаНДС		= СтавкаНДС(Деталь.VERGI_GOSTERGE);						//Перечисления.СтавкиНДС.БезНДС;
			ТекСтрока.СуммаНДС		= Деталь.VERGI_TUTAR;
			ТекСтрока.СчетКредит	= ПланыСчетов.Хозрасчетный.НайтиПоКоду("4890");
			ТекСтрока.Субконто1		= Док.Поставщик;
			ТекСтрока.Субконто2		= Док.ДоговорПоставщика;
			//ТекСтрока.Субконто3		=
		КонецЕсли;
	КонецЦикла;
	
	ДокЗаписать(Док, Ошибки);
КонецПроцедуры

Процедура ПоступлениеНоменклатурыСоздать(Шапка, Детали, Ссылка=Неопределено)
	Ошибки		= Новый Массив;
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Док = Ссылка.ПолучитьОбъект();
		Док.Номенклатура.Очистить();
		Док.Прочее.Очистить();
		Док.РасходыВключаемыеВСтоимость.Очистить();
	Иначе
		Док = Документы.ПоступлениеНоменклатурыПродаж.СоздатьДокумент();
		Док.Дата			= Шапка.KAYIT_TARIH;
		Док.Номер			= Шапка.MUHASEBE_BELGE_NO;
		Док.Организация		= Организация;
		Док.ОтражатьПоБУ	= Истина;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Док.Валюта) Тогда
	//	Док.Валюта			= ВалютаПолучить(Шапка.PARA_BIRIMI);
	//	Док.Курс			= КурсПолучить(Док.Валюта, Док.Дата);
	//КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Склад) Тогда
		Док.Склад			= СкладПолучить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Поставщик) Тогда
		Док.Поставщик		= КонтрагентПолучить(Шапка.SATICI, Шапка.SATICI_TX);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Поставщик) Тогда
		Ошибки.Добавить(СтрШаблон("Не найден Поставщик %2 по коду %1", Шапка.SATICI, Шапка.SATICI_TX));
		ДокументЗаполнить(Док);		// 4testonly
	ИначеЕсли НЕ ЗначениеЗаполнено(Док.ДоговорПоставщика) Тогда
		Док.ДоговорПоставщика				= ДоговорПоставщикаПолучить(Док.Поставщик);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.ДоговорПоставщика) Тогда
		Ошибки.Добавить("Не найден договор поставщика");
	КонецЕсли;
	Док.СчетУчетаРасчетовСКонтрагентом	= СчетУчетаРасчетовСКонтрагентом();
	//Док.ПриходныйДокумент
	//Док.ПриходныйДокументДата
	//Док.ЗаписыватьЦеныВСправочник			= Истина;
	//Док.НомерГТД		= 
	//Док.ДатаГТД			=
	//Док.НДСТаможенный	=
	//Док.СчетУчетаРасчетовСТаможней			=
	//Док.СубконтоТаможня1=
	//Док.СубконтоТаможня2=
	//Док.СубконтоТаможня3=
	//Док.ЗачестьАванс	= Истина;
	//Док.ТипРаспределения= Истина;
	
	СчетУчетаБУ			= СчетУчетаНайти();
	Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		Ошибки.Добавить("Не заполнен Счет учета БУ");
	КонецЕсли;
	
	Док.СуммаПоДокументу= 0;
	Для Каждого Деталь Из Детали Цикл
		ТекСтрока = Док.Номенклатура.Добавить();
		ТекСтрока.Номенклатура			= НоменклатураПродажНайти(Деталь.MALZEME, Деталь.PARTI);
		ТекСтрока.НоменклатурныйНомер	= Деталь.MALZEME;
		Если НЕ ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
			Ошибки.Добавить("Не найдена Номенклатура по коду " + Деталь.MALZEME);
		КонецЕсли;
		ТекСтрока.СчетУчетаБУ	= СчетУчетаБУ;
		ТекСтрока.Количество	= Деталь.MIKTAR;
		//ТекСтрока.ЦенаВВалюте	= Деталь.BIRIM_FIYAT;
		//ТекСтрока.Цена			= ТекСтрока.ЦенаВВалюте * Док.Курс;
		ТекСтрока.Цена			= Деталь.BIRIM_FIYAT;
		//ТекСтрока.СуммаВВалюте	= ТекСтрока.Количество * ТекСтрока.ЦенаВВалюте;
		ТекСтрока.Сумма			= ТекСтрока.Количество * ТекСтрока.Цена;			//	Деталь.TUTAR
		//ТекСтрока.Список
		//ТекСтрока.ПлатежПоНДС
		ТекСтрока.СтавкаНДС		= СтавкаНДС(Деталь.VERGI_GOSTERGE);
		ТекСтрока.СуммаНДС		= Деталь.VERGI_TUTAR;
		//ТекСтрока.ЗачетНДС
		Док.СуммаПоДокументу	= Док.СуммаПоДокументу + ТекСтрока.Сумма;
		
		//ТекСписки	= Док.Списки.Добавить();
	КонецЦикла;
	
	ДокЗаписать(Док, Ошибки);
КонецПроцедуры

Процедура ДокументЗаполнить(Документ, Валюта=Неопределено)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетЗачетаНДС.Поставщик КАК Поставщик,
	|	УчетЗачетаНДС.Договор КАК ДоговорПоставщика
	|ИЗ
	|	РегистрНакопления.УчетЗачетаНДС КАК УчетЗачетаНДС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО УчетЗачетаНДС.Поставщик = Контрагенты.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО УчетЗачетаНДС.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|	И ДоговорыКонтрагентов.Владелец = УчетЗачетаНДС.Поставщик
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагенты.ПометкаУдаления,
	|	ДоговорыКонтрагентов.ПометкаУдаления,
	|	УчетЗачетаНДС.Период УБЫВ");
	Запрос.УстановитьПараметр("Валюта",			?(Валюта=Неопределено, ВалютаПолучить(), Валюта));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Документ, Выборка);
	КонецЕсли;
КонецПроцедуры

Функция ДокументПоступленияСуществует(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНоменклатурыПродажВалютныйСписками КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация
	|	И Документ.Проведен = ИСТИНА");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.KAYIT_TARIH));
	Запрос.УстановитьПараметр("Номер",			Параметры.MUHASEBE_BELGE_NO);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Возврат (НЕ Запрос.Выполнить().Пустой());
КонецФункции

Функция ПоступлениеНоменклатурыПродажВалютныйСпискамиНайти(Параметры)
	Ответ	= Документы.ПоступлениеНоменклатурыПродажВалютныйСписками.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПоступлениеНоменклатурыПродажВалютныйСписками КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.KAYIT_TARIH));
	Запрос.УстановитьПараметр("Номер",			Параметры.MUHASEBE_BELGE_NO);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ =  Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ДокументНайти(Параметры)
	Ответ	= Документы.ПоступлениеНоменклатурыВалютныйСписками.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеНоменклатуры.Ссылка
	|ИЗ
	|	Документ.ПоступлениеНоменклатурыПродаж КАК ПоступлениеНоменклатуры
	|ГДЕ
	|	ГОД(ПоступлениеНоменклатуры.Дата) = &Дата
	|	И ПоступлениеНоменклатуры.Номер = &Номер
	|	И ПоступлениеНоменклатуры.Организация = &Организация");
	Запрос.УстановитьПараметр("Номер",			Параметры.MUHASEBE_BELGE_NO);
	Запрос.УстановитьПараметр("Дата",			Год(Параметры.KAYIT_TARIH));
	Запрос.УстановитьПараметр("Организация",	Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ	= Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция КонтрагентПолучить(Код, Наименование="~")
	Ответ	= Справочники.Контрагенты.ПустаяСсылка();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Соответствия.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.Соответствия КАК Соответствия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Справочник
	|		ПО Соответствия.Ссылка = Справочник.Ссылка
	|ГДЕ
	|	Соответствия.Код = &Код");
	Запрос.УстановитьПараметр("Код",			Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	(Контрагенты.ИНН = &Код
		|			ИЛИ Контрагенты.Наименование ПОДОБНО &Наименование
		|			ИЛИ Контрагенты.НаименованиеПолное ПОДОБНО &Наименование)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контрагенты.ПометкаУдаления,
		|	Контрагенты.Код = &Код УБЫВ";
		Запрос.УстановитьПараметр("Наименование",	"%" + Наименование + "%");
		//Если ПустаяСтрока(Наименование) Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Ответ = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ
КонецФункции

Функция СкладПолучить()
	Ответ	= Справочники.Склады.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	ХозрасчетныйОбороты.Субконто1 КАК Ссылка
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.Обороты(&ДатаН, , , , &ВидыСубконто, Организация = &Организация, , ) КАК ХозрасчетныйОбороты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Склады КАК Склады
	|		ПО ХозрасчетныйОбороты.Субконто1 = Склады.Ссылка
	|ГДЕ
	|	Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ВидСклада.Склад)
	|	И Склады.СчетУчетаПродукции.Код > "" ""
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склады.ПометкаУдаления,
	|	ХозрасчетныйОбороты.СуммаОборот УБЫВ");
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаН",			ДобавитьМесяц(ТекущаяДата(), -3));
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Склады);
	Запрос.УстановитьПараметр("ВидыСубконто",	ВидыСубконто);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ
КонецФункции

Функция ДоговорПоставщикаПолучить(Контрагент, Валюта=Неопределено)
	Ответ	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|			ТОГДА 1
	|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|			ТОГДА 2
	|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.Прочее)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Договоры.Ссылка = Контрагенты.ОсновнойДоговорКонтрагента
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Договоры.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	Договоры.Владелец = &Контрагент
	|	И Договоры.ВалютаВзаиморасчетов = &Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договоры.ПометкаУдаления,
	|	Порядок");
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Валюта",			?(Валюта=Неопределено, ВалютаПолучить(), Валюта));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ
КонецФункции

Функция ДоговорКонтрагентаПолучить(Контрагент, Валюта=Неопределено)
	Ответ	= Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПокупателем)
	|			ТОГДА 1
	//|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	//|			ТОГДА 2
	|		КОГДА Договоры.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.Прочее)
	|			ТОГДА 3
	|		ИНАЧЕ 4
	|	КОНЕЦ + ВЫБОР
	|		КОГДА Договоры.Ссылка = Контрагенты.ОсновнойДоговорКонтрагента
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Договоры.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	Договоры.Владелец = &Контрагент
	|	И Договоры.ВалютаВзаиморасчетов = &Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договоры.ПометкаУдаления,
	|	Порядок");
	Запрос.УстановитьПараметр("Контрагент",		Контрагент);
	Запрос.УстановитьПараметр("Валюта",			?(Валюта=Неопределено, ВалютаПолучить(), Валюта));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ
КонецФункции

Функция БанковскийСчетНайти(Владелец, Валюта=Неопределено)
	Ответ	= Справочники.БанковскиеСчета.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Договоры.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА Договоры.Ссылка = Договоры.Владелец.ОсновнойБанковскийСчет
	|			ТОГДА 0
	|		ИНАЧЕ 10
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.БанковскиеСчета КАК Договоры
	|ГДЕ
	|	Договоры.Владелец = &Владелец
	|	И Договоры.ВалютаДенежныхСредств = &Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Договоры.ПометкаУдаления,
	|	Порядок");
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Запрос.УстановитьПараметр("Валюта",			?(Валюта=Неопределено, ВалютаПолучить(), Валюта));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ
КонецФункции

Функция СчетУчетаНайти(Код="2911")
	Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду(Код);
КонецФункции

Функция НоменклатураПродажНайти(Код, Серия="") Экспорт
	Ответ = Справочники.НоменклатураПродаж.ПустаяСсылка();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Соответствия.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.Соответствия КАК Соответствия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураПродаж КАК НоменклатураПродаж
	|		ПО Соответствия.Ссылка = НоменклатураПродаж.Ссылка
	|ГДЕ
	|	Соответствия.Код = &Код");
	Запрос.УстановитьПараметр("Код",			Код + "/" + Серия);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ =  Выборка.Ссылка;
	ИначеЕсли НЕ ПустаяСтрока(Серия) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	НоменклатураПродаж.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.НоменклатураПродаж КАК НоменклатураПродаж
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AsfarmaID КАК Asfarma
		               |		ПО НоменклатураПродаж.AsfarmaID = Asfarma.Ссылка
		               |ГДЕ
		               |	Asfarma.Код = &Код
		               |	И НоменклатураПродаж.ПометкаУдаления = ЛОЖЬ
		               |	И НоменклатураПродаж.Серия ПОДОБНО &Серия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НоменклатураПродаж.СрокГодности УБЫВ";
		Запрос.УстановитьПараметр("Код",	Код);
		Запрос.УстановитьПараметр("Серия",	Серия);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Ответ = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция НоменклатураПродажПодобрать(Код, Серия="", Родитель="")
	Ответ = НоменклатураПродажНайти(Код, Серия);
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Номенклатура.Ссылка КАК Ссылка
	//|ИЗ
	//|	Справочник.НоменклатураПродаж КАК Номенклатура
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AsfarmaID КАК AsfarmaIDs
	//|		ПО Номенклатура.AsfarmaID = AsfarmaIDs.Ссылка
	//|ГДЕ
	//|	Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатурыПродаж.Товар)
	//|	И Номенклатура.ПометкаУдаления = ИСТИНА
	//|	И AsfarmaIDs.Код В(&Коды)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	AsfarmaIDs.Код");
	//Коды	= Новый Массив;
	//Коды.Добавить(Параметры.MALZEME);
	//Коды.Добавить(Лев(Параметры.MALZEME, 5));
	//Запрос.УстановитьПараметр("Коды",			Коды);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Ответ = Выборка.Ссылка;
	//Иначе
	//	Справочник	= Справочники.НоменклатураПродаж.СоздатьЭлемент();
	//	Справочник.Код						= Параметры.MALZEME;
	//	Справочник.Наименование				= Параметры.MALZEME_TX;
	//	Справочник.НаименованиеПолное		= Параметры.MALZEME_TX;
	//	Справочник.БазоваяЕдиницаИзмерения	= БазоваяЕдиницаИзмеренияНайти(Параметры);
	//	Справочник.СтавкаНДС				= СтавкаНДС(Параметры.VERGI_GOSTERGE);
	//	Справочник.ВидНоменклатуры			= Перечисления.ВидыНоменклатурыПродаж.Товар;
	//	//Справочник.БазоваяЦена				= Параметры.BIRIM_FIYAT;
	//	//Справочник.Цена						= Параметры.BIRIM_FIYAT;
	//	//Справочник.Группа					= Параметры.;
	//	Справочник.Серия					= Параметры.PARTI;
	//	Справочник.СрокГодности				= Параметры.SKT;
	//	//Справочник.ДатаРегистрации			= Параметры.;
	//	//Справочник.НомерКонтракта			= Параметры.;
	//	//Справочник.СерияКонтракта			= Параметры.;
	//	Справочник.AsfarmaID				= AsfarmaIDСоздать(Параметры);
	//	Если Справочник.ПроверитьЗаполнение() Тогда
	//		Попытка
	//			Справочник.Записать();
	//			Ответ = Справочник.Ссылка;
	//			
	//			//Если ЗначениеЗаполнено(Справочник.БазоваяЕдиницаИзмерения) Тогда
	//			//КонецЕсли;
	//		Исключение КонецПопытки;
	//	КонецЕсли;
	//КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Ответ)
	И НЕ ПустаяСтрока(Серия) Или НЕ ПустаяСтрока(Родитель)
	Тогда
		Запрос	= Новый Запрос;
		Запрос.УстановитьПараметр("Код",	Код);
		Запрос.УстановитьПараметр("Серия",	Серия);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	НоменклатураПродаж.Наименование КАК Наименование,
		               |	НоменклатураПродаж.НаименованиеПолное КАК НаименованиеПолное,
		               |	НоменклатураПродаж.СтавкаНДС КАК СтавкаНДС,
		               |	НоменклатураПродаж.ВидНоменклатуры КАК ВидНоменклатуры,
		               |	НоменклатураПродаж.Гост КАК Гост,
		               |	НоменклатураПродаж.ТипТовара КАК ТипТовара,
		               |	НоменклатураПродаж.СтранаПроисхождения КАК СтранаПроисхождения,
		               |	НоменклатураПродаж.Организация КАК Организация,
		               |	НоменклатураПродаж.Полуфабрикат КАК Полуфабрикат,
		               |	НоменклатураПродаж.Производитель КАК Производитель,
		               |	НоменклатураПродаж.КоличествоВУпаковке КАК КоличествоВУпаковке,
		               |	НоменклатураПродаж.ПроисхождениеТовара КАК ПроисхождениеТовара,
		               |	НоменклатураПродаж.AsfarmaID КАК AsfarmaID,
		               |	НоменклатураПродаж.ВидДеятельностиНДС КАК ВидДеятельностиНДС,
		               |	НоменклатураПродаж.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмерения,
		               |	НоменклатураПродаж.Группа КАК Группа,
		               |	НоменклатураПродаж.БазоваяЦена КАК БазоваяЦена,
		               |	НоменклатураПродаж.Цена КАК Цена,
		               |	НоменклатураПродаж.Ссылка КАК Виктим,
		               |	НоменклатураПродаж.ЕдиницаДляОтчетов КАК ЕдиницаДляОтчетовНаименование,
		               |	НоменклатураПродаж.ЕдиницаХраненияОстатков КАК ЕдиницаХраненияОстатковНаименование
		               |ИЗ
		               |	Справочник.НоменклатураПродаж КАК НоменклатураПродаж
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AsfarmaID КАК Asfarma
		               |		ПО НоменклатураПродаж.AsfarmaID = Asfarma.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		               |		ПО НоменклатураПродаж.БазоваяЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Перечисление.ВидыНоменклатурыПродаж КАК ВидыНоменклатурыПродаж
		               |		ПО НоменклатураПродаж.ВидНоменклатуры = ВидыНоменклатурыПродаж.Ссылка
		               |ГДЕ
		               |	Asfarma.Код = &Код
		               |	И НоменклатураПродаж.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НоменклатураПродаж.ПометкаУдаления,
		               |	НоменклатураПродаж.СрокГодности УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Родитель	= Справочники.НоменклатураПродаж.СоздатьГруппу();
			Родитель.Наименование		= ?(ПустаяСтрока(Родитель), "Импортные поставки " + Серия, Родитель);
			//Группа.НомерКонтракта	= "";
			//Группа.СерияКонтракта	= "";
			//Группа.ДатаРегистрации	= ;
			Родитель.УстановитьНовыйКод();
			Если Родитель.ПроверитьЗаполнение() Тогда
				Попытка
					Родитель.Записать();
				Исключение
				КонецПопытки;
				
				Справочник	= Справочники.НоменклатураПродаж.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(Справочник,  Выборка);
				Справочник.Серия			= Серия;
				//Справочник.СрокГодности	= 
				Справочник.УстановитьНовыйКод();
				Если Справочник.ПроверитьЗаполнение() Тогда
					Попытка
						Справочник.Записать();
						Ответ	= Справочник.Ссылка;
					Исключение
					КонецПопытки;
					
					Если НЕ ПустаяСтрока(Выборка.ЕдиницаДляОтчетовНаименование) Или НЕ ПустаяСтрока(Выборка.ЕдиницаХраненияОстатковНаименование) Тогда
						Запрос.Текст	= "ВЫБРАТЬ
						            	  |	&Владелец КАК Владелец,
						            	  |	ЕИ.Наименование КАК Наименование,
						            	  |	&Владелец КАК ЕдиницаПоКлассификатору,
						            	  |	ЕИ.Вес КАК Вес,
						            	  |	ЕИ.Объем КАК Объем,
						            	  |	ЕИ.Коэффициент КАК Коэффициент
						            	  |ИЗ
						            	  |	Справочник.ЕдиницыИзмерения КАК ЕИ
						            	  |ГДЕ
						            	  |	ЕИ.Владелец = &Владелец
						            	  |
						            	  |УПОРЯДОЧИТЬ ПО
						            	  |	ЕИ.ПометкаУдаления";
						Запрос.УстановитьПараметр("Владелец",	Выборка.Виктим);
						ЕИ = Запрос.Выполнить().Выбрать();
						Если ЕИ.Следующий() Тогда
							ЕдиницаДляОтчетов	= Справочники.ЕдиницыИзмерения.СоздатьЭлемент();
							ЗаполнитьЗначенияСвойств(ЕдиницаДляОтчетов, ЕИ);
							ЕдиницаДляОтчетов.УстановитьНовыйКод();
							Если ЕдиницаДляОтчетов.ПроверитьЗаполнение() Тогда
								Попытка
									ЕдиницаДляОтчетов.Записать();
									Если НЕ ПустаяСтрока(Выборка.ЕдиницаДляОтчетовНаименование) Тогда
										Справочник.ЕдиницаДляОтчетов		= ЕдиницаДляОтчетов;
									КонецЕсли;
									Если НЕ ПустаяСтрока(Выборка.ЕдиницаХраненияОстатковНаименование) Тогда
										Справочник.ЕдиницаХраненияОстатков	= ЕдиницаДляОтчетов;
									КонецЕсли;
									Справочник.Записать();
								Исключение
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция AsfarmaIDСоздать(Параметры)
	Ответ = Справочники.AsfarmaID.ПустаяСсылка();
	
	Справочник	= Справочники.AsfarmaID.СоздатьЭлемент();
	Справочник.Код						= Параметры.MALZEME;
	Справочник.Наименование				= Параметры.MALZEME_TX;
	Если Справочник.ПроверитьЗаполнение() Тогда
		Попытка
			Справочник.Записать();
			Ответ = Справочник.Ссылка;
		Исключение КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СпискиПоступленияНоменклатурыВВалютеПодобрать(ДанныеСтроки, Параметры)
	Ответ	= Справочники.СпискиПоступленияНоменклатурыВВалюте.ПустаяСсылка();
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	Товары.Список КАК Ссылка
	      	               |ИЗ
	      	               |	Документ.ПоступлениеНоменклатурыПродажВалютныйСписками.Номенклатура КАК Товары
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНоменклатурыПродажВалютныйСписками КАК Поступление
	      	               |		ПО Товары.Ссылка = Поступление.Ссылка
	      	               |ГДЕ
	      	               |	Товары.Номенклатура = &Номенклатура
	      	               |	И Поступление.Проведен = ИСТИНА
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Поступление.Дата УБЫВ");
	Запрос.УстановитьПараметр("Номенклатура", ДанныеСтроки.Номенклатура);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция БазоваяЕдиницаИзмеренияНайти(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КлассификаторЕИ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НоменклатураПродаж КАК Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕИ
	|		ПО Номенклатура.БазоваяЕдиницаИзмерения = КлассификаторЕИ.Ссылка
	|ГДЕ
	|	(КлассификаторЕИ.Наименование = &Код
	|			ИЛИ Номенклатура.Наименование = &Наименование)
	|	И Номенклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатурыПродаж.Товар)
	|
	|УПОРЯДОЧИТЬ ПО
	|	КлассификаторЕИ.Наименование = &Код УБЫВ");
	Запрос.УстановитьПараметр("Код",			Параметры.OLCU_BIRIMI);
	Запрос.УстановитьПараметр("Наименование",	Параметры.MALZEME_TX);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КлассификаторЕИ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕИ
	               |ГДЕ
	               |	КлассификаторЕИ.Наименование = &Наименование";
	Запрос.УстановитьПараметр("Наименование",	"шт.");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
КонецФункции

Функция НацВалюта()
	Если НЕ ЗначениеЗаполнено(НацВалюта) Тогда
		НацВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	Возврат НацВалюта;
КонецФункции

Функция ВалютаПолучить(Код="")
	Если ПустаяСтрока(Код) Или СтрСравнить(Код, "UZS") = 0 Тогда
		Возврат НацВалюта();
	КонецЕсли;
	
	Ответ = Справочники.Валюты.ПустаяСсылка();
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Валюты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Валюты КАК Валюты
	|ГДЕ
	|	(Валюты.Наименование = &Код
	|			ИЛИ Валюты.Код = &Код)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Валюты.ПометкаУдаления");
	Запрос.УстановитьПараметр("Код",			Код);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция КурсПолучить(Валюта, Период)
	Если Валюта = НацВалюта() Тогда
		Возврат 1;
	КонецЕсли;
	
	Ответ	= 0;
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Курсы.Кратность = 0
	|			ТОГДА Курсы.Курс
	|		ИНАЧЕ Курсы.Курс / Курсы.Кратность
	|	КОНЕЦ КАК Курс
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК Курсы");
	Запрос.УстановитьПараметр("Валюта",			Валюта);
	Запрос.УстановитьПараметр("Период",			Период);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Курс;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СчетУчетаРасчетовСКонтрагентом(Валютный=Ложь)
	Возврат ?(Валютный, ПланыСчетов.Хозрасчетный.А6011, ПланыСчетов.Хозрасчетный.А6010);
КонецФункции

Функция СтавкаНДС(Код="")
	Если СтрСравнить(Код, "T1") = 0 Тогда
		Возврат Перечисления.СтавкиНДС.НДС15;
	КонецЕсли;
	Возврат Перечисления.СтавкиНДС.БезНДС;
КонецФункции

Процедура РеализацияМедикаментовСоздатьНаСервере(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZSD_011_S_DATA;
	КонецЕсли;
	ТЧ.Сортировать("BILLDOC,ITEMNO");
	
	Настроить(ЭтотОбъект);
	мДоки	= Новый Массив;
	Для Каждого ТекСтрока Из ТЧ Цикл
		Если мДоки.Найти(ТекСтрока.BILLDOC) = Неопределено Тогда
			Если ДокументРеализацияСуществует(ТекСтрока) Тогда
				
			Иначе
				Строки = ТЧ.НайтиСтроки(Новый Структура("BILLDOC", ТекСтрока.BILLDOC));
				РеализацияМедикаментовСоздать(ТекСтрока, Строки);
				//
				//Прервать;
			КонецЕсли;
			
			мДоки.Добавить(ТекСтрока.BILLDOC);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура РеализацияМедикаментовСоздать(Шапка, Детали)
	Ошибки		= Новый Массив;
	Ссылка		= ДокументРеализацияНайти(Шапка);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Док = Ссылка.ПолучитьОбъект();
		Если Док.ПометкаУдаления Тогда
			Док.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Док.Номенклатура.Очистить();
		Док.Услуги.Очистить();

	Иначе
		Док = Документы.РеализацияМедикаментов.СоздатьДокумент();
		Док.Дата			= Шапка.BILLDATE;
		Док.Номер			= Шапка.BILLDOC;
		Док.Организация		= Организация;
		Док.ОтражатьПоБУ	= Истина;
		Док.БанковскийСчет	= БанковскийСчетНайти(Док.Организация);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Склад) Тогда
		Док.Склад			= СкладПолучить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Контрагент) Тогда
		Док.Контрагент		= КонтрагентПолучить(Шапка.VKN);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Контрагент) Тогда
		Ошибки.Добавить(СтрШаблон("Не найден Контрагент по коду %1", Шапка.PAYER));
		ДокументЗаполнить(Док);		// 4testonly
	ИначеЕсли НЕ ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		Док.ДоговорКонтрагента				= ДоговорКонтрагентаПолучить(Док.Контрагент);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
		Ошибки.Добавить("Не найден договор Контрагента");
	КонецЕсли;
	Док.СчетУчетаРасчетовСКонтрагентомБУ	= СчетУчетаРасчетовСКонтрагентом();
	Док.БанковскийСчетКонтрагента			= БанковскийСчетНайти(Док.Контрагент);
	//Док.ЗачестьАванс	= Истина;
	
	СчетУчетаБУ			= СчетУчетаНайти("2910");
	Если НЕ ЗначениеЗаполнено(СчетУчетаБУ) Тогда
		Ошибки.Добавить("Не заполнен Счет учета БУ");
	КонецЕсли;
	
	Док.СуммаПоДокументу		= 0;
	Док.КоличествоПоДокументу	= 0;
	Для Каждого Деталь Из Детали Цикл
		Если СтрСравнить(Деталь.BILLTYP, "ZA01") = 0 Тогда
		ИначеЕсли СтрСравнить(Деталь.BILLTYP, "ZH01") = 0 Тогда
			ТекСтрока = Док.Услуги.Добавить();
			ТекСтрока.Услуга		= НоменклатураПродажНайти(Деталь.MATERIAL);
			//ТекСтрока.СчетУчета	= 
			ТекСтрока.Сумма			= Деталь.TOTALPRICE;
			ТекСтрока.СтавкаНДС		= СтавкаНДС();
			ТекСтрока.СуммаНДС		= ТекСтрока.Сумма * ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС) * 0.01;
			
		//ИначеЕсли СтрСравнить(Деталь.BILLTYP, "ZI02") = 0 Тогда
		//ИначеЕсли СтрСравнить(Деталь.BILLTYP, "ZB01") = 0 Тогда
		//ИначеЕсли СтрСравнить(Деталь.BILLTYP, "ZS06") = 0 Тогда
		Иначе	//Если СтрСравнить(Деталь.BILLTYP, "ZS07") = 0 Тогда
			ТекСтрока = Док.Номенклатура.Добавить();
			ТекСтрока.Номенклатура	= НоменклатураПродажНайти(Деталь.MATERIAL, Деталь.BATCH);
			ТекСтрока.НоменклатурныйНомер	= ТекСтрока.Номенклатура.Код;
			Если ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
				ТекСтрока.ЕдиницаИзмерения	= ЕдиницаИзмеренияНайти(ТекСтрока.Номенклатура, Деталь.UNIT);
			Иначе
				Ошибки.Добавить(СтрШаблон("Строка %1. Не найдена Номенклатура по коду %2", ТекСтрока.НомерСтроки, Деталь.MATERIAL));
			КонецЕсли;
			ТекСтрока.СчетУчетаБУ	= СчетУчетаБУ;
			ТекСтрока.Серия			= Деталь.BATCH;
			ТекСтрока.Количество	= Деталь.QUANTITY;
			ТекСтрока.Цена			= ?(Деталь.QUANTITY = 0, Деталь.TOTALPRICE, Деталь.TOTALPRICE / Деталь.QUANTITY);
			ТекСтрока.Себестоимость	= Деталь.COST;
			ТекСтрока.Сумма			= Деталь.TOTALPRICE;
			ТекСтрока.Наценка		= Деталь.PROFITMARJIN;
			ТекСтрока.СтавкаНДС		= ТекСтрока.Номенклатура.СтавкаНДС;
			ТекСтрока.СуммаНДС		= ТекСтрока.Сумма * ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС) * 0.01;
			ТекСтрока.СрокГодности	= ТекСтрока.Номенклатура.СрокГодности;
		КонецЕсли;
	//	Док.СуммаПоДокументу	= Док.СуммаПоДокументу + ТекСтрока.Сумма;
	КонецЦикла;
	
	ДокЗаписать(Док, Ошибки);
КонецПроцедуры

Функция ЕдиницаИзмеренияНайти(Владелец, КодКлассификатора)
	Ответ	= Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	ЕИ.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Соответствия.Код, "" "") = &Код
	|			ТОГДА 1
	|		КОГДА ЕИ.Ссылка = ЕИ.Владелец.ЕдиницаХраненияОстатков
	|			ТОГДА 2
	|		ИНАЧЕ 3
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕИ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Соответствия КАК Соответствия
	|		ПО ЕИ.ЕдиницаПоКлассификатору = Соответствия.Ссылка
	|ГДЕ
	|	ЕИ.Владелец = &Владелец
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок,
	|	ЕИ.ПометкаУдаления");
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Запрос.УстановитьПараметр("Код",			КодКлассификатора);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ =  Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ДокументРеализацияНайти(Параметры)
	Ответ	= Документы.РеализацияМедикаментов.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияМедикаментов КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.BILLDATE));
	Запрос.УстановитьПараметр("Номер",			Параметры.BILLDOC);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ =  Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ДокументРеализацияСуществует(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.РеализацияМедикаментов КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация
	|	И Документ.Проведен = ИСТИНА");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.BILLDATE));
	Запрос.УстановитьПараметр("Номер",			Параметры.BILLDOC);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Возврат (НЕ Запрос.Выполнить().Пустой());
КонецФункции

Процедура УслугиСтороннихСоздатьНаСервере(ТЧ=Неопределено) Экспорт
	Если ТЧ = Неопределено Тогда
		ТЧ = ZFI_011_FG_1C;
	КонецЕсли;
	ТЧ.Сортировать("DOCNO,POSTITEMFORLEDGER");
	
	Настроить(ЭтотОбъект);
	мДоки	= Новый Массив;
	Для Каждого ТекСтрока Из ТЧ Цикл
		Если мДоки.Найти(ТекСтрока.DOCNO) = Неопределено Тогда
			Если УслугиСтороннихОрганизацийСуществует(ТекСтрока) Тогда
				
			Иначе
				Строки = ТЧ.НайтиСтроки(Новый Структура("DOCNO", ТекСтрока.DOCNO));
				УслугиСтороннихОрганизацийСоздать(ТекСтрока, Строки);
			КонецЕсли;
			
			мДоки.Добавить(ТекСтрока.DOCNO);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура УслугиСтороннихОрганизацийСоздать(Шапка, Детали)
	Ошибки		= Новый Массив;
	Ссылка		= УслугиСтороннихОрганизацийНайти(Шапка);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Док = Ссылка.ПолучитьОбъект();
		Если Док.ПометкаУдаления Тогда
			Док.УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Док.Услуги.Очистить();

	Иначе
		Док = Документы.УслугиСтороннихОрганизаций.СоздатьДокумент();
		Док.Дата			= Шапка.DOCDATE;
		Док.Номер			= Шапка.DOCNO;
		Док.Организация		= Организация;
		Док.ОтражатьПоБУ	= Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Док.Валюта) Тогда
		Док.Валюта			= ВалютаПолучить(Шапка.CURRENCY);
		Док.Курс			= КурсПолучить(Док.Валюта, Док.Дата);
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Док.Контрагент) Тогда
	//	Док.Контрагент		= КонтрагентПолучить(Шапка.PAYER);
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Док.Контрагент) Тогда
	//	Ошибки.Добавить(СтрШаблон("Не найден Контрагент по коду %1", Шапка.PAYER));
	//	ДокументЗаполнить(Док);		// 4testonly
	//ИначеЕсли НЕ ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
	//	Док.ДоговорКонтрагента				= ДоговорКонтрагентаПолучить(Док.Контрагент);
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(Док.ДоговорКонтрагента) Тогда
	//	Ошибки.Добавить("Не найден договор Контрагента");
	//КонецЕсли;
	//Док.СчетРасчетовСКонтрагентом	= СчетУчетаРасчетовСКонтрагентом();
	//Док.ЗачестьАванс	= Истина;
	//Док.ПриходныйДокумент		= Шапка.REFBELNO;
	//Док.ПриходныйДокументДата	= Шапка.POSTDATE;
	//Док.СчетЗатрат				= ;
	Для Каждого Деталь Из Детали Цикл
		ТекСтрока = Док.Услуги.Добавить();
		ТекСтрока.ОписаниеУслуги	= Деталь.DOCTYP_DESC;
		//ТекСтрока.Количество		= 
		ТекСтрока.Сумма				= Деталь.AMOUNT_TRANSACTIONCURR;
		//ТекСтрока.СтавкаНДС			= 
		//ТекСтрока.СуммаНДС			= 
	КонецЦикла;
	
	ДокЗаписать(Док, Ошибки);
КонецПроцедуры

Процедура ДокЗаписать(Док, Ошибки)
	Док.Ответственный	= Ответственный;
	Док.Комментарий		= СтрСоединить(Ошибки, ",");
	
	Если Док.ПроверитьЗаполнение() Тогда
		Попытка
			Док.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
		Исключение
			//Ошибки.Добавить(ОписаниеОшибки());
			//Док.Комментарий	= СтрСоединить(Ошибки, ",");
		КонецПопытки;
	КонецЕсли;
	Если Док.Модифицированность() Тогда
		Док.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
КонецПроцедуры

Функция УслугиСтороннихОрганизацийСуществует(Параметры)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УслугиСтороннихОрганизаций КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация
	|	И Документ.Проведен = ИСТИНА");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.DOCDATE));
	Запрос.УстановитьПараметр("Номер",			Параметры.DOCNO);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Возврат (НЕ Запрос.Выполнить().Пустой());
КонецФункции

Функция УслугиСтороннихОрганизацийНайти(Параметры)
	Ответ	= Документы.УслугиСтороннихОрганизаций.ПустаяСсылка();
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.УслугиСтороннихОрганизаций КАК Документ
	|ГДЕ
	|	ГОД(Документ.Дата) = &ГГ
	|	И Документ.Номер = &Номер
	|	И Документ.Организация = &Организация");
	Запрос.УстановитьПараметр("ГГ",				Год(Параметры.DOCDATE));
	Запрос.УстановитьПараметр("Номер",			Параметры.DOCNO);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ =  Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции
