
Процедура СохранитьНастройкуСписка(ИмяСправочника,ФормаСправочника,ИмяСписка) Экспорт
	
	#Если Клиент Тогда
	
	Структура= новый Структура;	
	Структура.Вставить("ИерархическийПросмотр",ФормаСправочника.ЭлементыФормы[ИмяСписка].ИерархическийПросмотр);
	Структура.Вставить("КоличествоПорядковСортировки",ФормаСправочника[ИмяСписка].Порядок.Количество());
	
	Для н=0 По ФормаСправочника[ИмяСписка].Порядок.Количество()-1 Цикл
		
		ИмяПорядка=ФормаСправочника[ИмяСписка].Порядок[н].Имя;
		НаправлениеПорядка=ФормаСправочника[ИмяСписка].Порядок[н].Направление;
		
		Структура.Вставить("Порядок"+Строка(н),ИмяПорядка+?(НаправлениеПорядка=НаправлениеСортировки.Возр," Возр"," Убыв"));
	
	КонецЦикла; 
	
	СохранитьЗначение("НастройкаСписка"+ИмяСправочника+ИмяСписка,Структура);
	#КонецЕсли 
	
	
КонецПроцедуры	

Процедура ВосстановитьНастройкуСписка(ИмяСправочника,ФормаСправочника,ИмяСписка) Экспорт
	
	#Если Клиент Тогда
	НастройкаСписка=ВосстановитьЗначение("НастройкаСписка"+ИмяСправочника+ИмяСписка);
	
	Если НастройкаСписка<>неопределено Тогда
		
		ФормаСправочника.ЭлементыФормы[ИмяСписка].ИерархическийПросмотр=НастройкаСписка.ИерархическийПросмотр;	
		
		КоличествоПорядковСортировки=НастройкаСписка.КоличествоПорядковСортировки;
		
		Если КоличествоПорядковСортировки>0 Тогда
			
			Порядок="";
			Для н=0 По КоличествоПорядковСортировки-1 Цикл
				Порядок=Порядок+НастройкаСписка["Порядок"+Строка(н)]+",";
			КонецЦикла; 
			Порядок=Лев(Порядок,СтрДлина(Порядок)-1);
			ФормаСправочника[ИмяСписка].Порядок.Установить(Порядок);
		КонецЕсли; 
		
	КонецЕсли; 
	#КонецЕсли 
	
КонецПроцедуры	

Процедура СохранитьНастройкуСпискаДокумент(ИмяДокумента,ФормаДокумента,ИмяСписка) Экспорт
	
	#Если Клиент Тогда
	
	Структура= новый Структура;	
	Структура.Вставить("КоличествоПорядковСортировки",ФормаДокумента[ИмяСписка].Порядок.Количество());
	
	Для н=0 По ФормаДокумента[ИмяСписка].Порядок.Количество()-1 Цикл
		
		ИмяПорядка=ФормаДокумента[ИмяСписка].Порядок[н].Имя;
		НаправлениеПорядка=ФормаДокумента[ИмяСписка].Порядок[н].Направление;
		
		Структура.Вставить("Порядок"+Строка(н),ИмяПорядка+?(НаправлениеПорядка=НаправлениеСортировки.Возр," Возр"," Убыв"));
	
	КонецЦикла; 
	
	СохранитьЗначение("НастройкаСписка"+ИмяДокумента+ИмяСписка,Структура);
	#КонецЕсли 
	
	
КонецПроцедуры	

Процедура ВосстановитьНастройкуСпискаДокумент(ИмяДокумент,ФормаДокумент,ИмяСписка) Экспорт
	
	#Если Клиент Тогда
	НастройкаСписка=ВосстановитьЗначение("НастройкаСписка"+ИмяДокумент+ИмяСписка);
	
	Если НастройкаСписка<>неопределено Тогда
		
		
		КоличествоПорядковСортировки=НастройкаСписка.КоличествоПорядковСортировки;
		
		Если КоличествоПорядковСортировки>0 Тогда
			
			Порядок="";
			Для н=0 По КоличествоПорядковСортировки-1 Цикл
				Порядок=Порядок+НастройкаСписка["Порядок"+Строка(н)]+",";
			КонецЦикла; 
			Порядок=Лев(Порядок,СтрДлина(Порядок)-1);
			ФормаДокумент[ИмяСписка].Порядок.Установить(Порядок);
		КонецЕсли; 
		
	КонецЕсли; 
	#КонецЕсли 
	
КонецПроцедуры	
