
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	ДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("ПП","Платежное поручение валютное");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
//
//    //Здесь следует написать алгоритм проведения документа
//
КонецПроцедуры

Функция ПечатьППвалютное()
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ППВалютное1");
	
	Руководители = ОтветственныеЛица(Организация, Дата);	
	Область = Макет.ПолучитьОбласть("ПП");
	
	Область.Параметры.Номер = Формат(Номер,"ЧГ=0");
	
	Если БанковскийСчет.МесяцПрописью Тогда
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=DD");
	Иначе
		Область.Параметры.Дата = Формат(Дата,"ДЛФ=D")+" г.";
	КонецЕсли; 	
	
	Область.Параметры.Заполнить(Руководители);
	СведенияОбОрганизации=СведенияОЮрФизЛице(Организация, БанковскийСчет, Дата);

	Область.Параметры.Адрес =СведенияОбОрганизации.ОрганизацияЮридическийАдресНаАнглийском;
	Область.Параметры.ОрганизацияАнглийское = Организация.НаименованиеНаАнглийском;
	Область.Параметры.БанкБенефициараНаименование= ОписаниеБанкаБенефициара ;
	Область.Параметры.КорреспондентБанкаБенефициара= ОписаниеБанкаКорреспондента;
	
	Область.Параметры.БанковскийСчетБенефициара= БанковскийСчетБенефициара.НомерСчета;
	Область.Параметры.Бенефициар= СокрЛП(Бенефициар.НаименованиеПолное)+","+БанковскийСчетБенефициара.Банк.НаименованиеНаАнглийском+","+БанковскийСчетБенефициара.Банк.Город + ","+БанковскийСчетБенефициара.Банк.Адрес;
	
	
	Область.Параметры.НомерБанковскогоСчета = БанковскийСчет.НомерСчета;
	//Область.Параметры.Банк = БанковскийСчет.Банк.Наименование;
	Область.Параметры.БанкАнглийское = БанковскийСчет.Банк.НаименованиеНаАнглийском;
	Область.Параметры.БанкАнглийскоеАдрес = БанковскийСчет.Банк.Город + ","+БанковскийСчет.Банк.Адрес;
	
	
	СуммаНаПечать=Формат(Сумма,"ЧЦ=18; ЧДЦ=2; ЧРД=.; ЧРГ=");
	Область.Параметры.Сумма = СуммаНаПечать;
	Область.Параметры.Валюта = Валюта;
	Область.Параметры.НазначениеПлатежа=СокрЛП(НазначениеПлатежа);
	Область.Параметры.НазначениеПлатежаОсобыеУсловия=СокрЛП(НазначениеПлатежаОсобыеУсловия);
	Область.Параметры.СчетДляКомиссии=СчетДляКомиссии;
	
	Если КомиссияЗаСчет Тогда 
		Область.Параметры.Отправитель="Х";
		Область.Параметры.Получатель=" ";
	Иначе
		Область.Параметры.Отправитель=" ";
		Область.Параметры.Получатель="Х";
	КонецЕсли;
	
	Если СокрЛП(Валюта.Код)="840" Тогда  
		Область.Параметры.СуммаПрописью=ЧислоПрописью(Сумма,"L=en_US;SN=true;FN=true;FS=true","dollar, dollars, cent, cents, 2");
	ИначеЕсли Валюта.Код="978" Тогда
		Область.Параметры.СуммаПрописью=ЧислоПрописью(Сумма,"L=en_US;SN=true;FN=true;FS=true","EURO, EURO, М, EUROCent, EUROCent, M, 2");
	Иначе
		Область.Параметры.СуммаПрописью = ПроцедурыСервера.СформироватьСуммуПрописью_Сервер(Сумма,Валюта);
	КонецЕсли;	
	Область.Параметры.Заполнить(Руководители);
	ТабДок.Вывести(Область);
	
	ТабДок.ЭкземпляровНаСтранице=1;
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	ТабДокумент = ПечатьППвалютное();
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "Плат. пор.валютное");
	
КонецПроцедуры // Печать()


//Возвращает таблицу значений с данными о контактной информации по заданным параметрам
//
Функция ПолучитьДанныеКонтактнойИнформации(Объект, ТипИнформации = Неопределено, ВидИнформации = Неопределено)

	Запрос = Новый Запрос;

	СтрокаВиртуальныхПараметров = "КонтактнаяИнформация.Объект = &Объект";

	Если ТипИнформации <> Неопределено Тогда
		СтрокаВиртуальныхПараметров = СтрокаВиртуальныхПараметров + " И КонтактнаяИнформация.Тип = &Тип";
		Запрос.УстановитьПараметр("Тип", ТипИнформации);
	КонецЕсли;

	Если ВидИнформации <> Неопределено Тогда
		СтрокаВиртуальныхПараметров = СтрокаВиртуальныхПараметров + " И КонтактнаяИнформация.Вид = &Вид";
		Запрос.УстановитьПараметр("Вид", ВидИнформации);
	КонецЕсли;

	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КонтактнаяИнформация.Объект        КАК Объект,
	|	КонтактнаяИнформация.Вид           КАК Вид,
	|	КонтактнаяИнформация.Тип           КАК Тип,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|
	|ГДЕ
	|	" + СтрокаВиртуальныхПараметров + "";

	Запрос.УстановитьПараметр("ДатаСреза", ?(Дата = '00010101000000', Неопределено, Дата));
	Запрос.УстановитьПараметр("Объект"   , Объект);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции // ПолучитьДанныеКонтактнойИнформации()

