
// Процедура установки типа и доступности субконто в зависимости от  выбранного счета
////

Функция КоличествоСубконто(Счет)
	Возврат Счет.ВидыСубконто.Количество();
КонецФункции	


// Выводит на печать подготовленный макет 
//
// Параметры:
//  ПечДокумент            - ТабличыйДокумент, макет на печать,
//  КоличествоЭкземпляров  - Число, количество экземпляров на печать,
//  НаПринтер              - Булево, Если истина, то выводим сразу на принтер.
//  Заголовок              - Заголовок окна табличного документа
//  НепосредственнаяПечать - используется только для режи
Процедура НапечататьДокумент_УП(ПечДокумент, КоличествоЭкземпляров = 1, НаПринтер = Ложь, Заголовок = "", НепосредственнаяПечать = Ложь, ТолькоПросмотр = Истина, ОтображатьЗаголовки = Ложь, ОтображатьСетку = Ложь, Защита = Ложь) Экспорт
	
	Если ПечДокумент = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	// Получить необходимое количество копий
	Если КоличествоЭкземпляров > 0 Тогда
		ПечДокумент.КоличествоЭкземпляров = КоличествоЭкземпляров;
	КонецЕсли;
	
	Если НЕ ПечДокумент.АвтоМасштаб
		И не ЗначениеЗаполнено(ПечДокумент.ИмяПринтера) Тогда
		ПечДокумент.АвтоМасштаб = Истина;
	КонецЕсли;
	
	Если НаПринтер Тогда
		
		ПечДокумент.Напечатать(НепосредственнаяПечать = Истина);
		
	Иначе
		
		// Отобразить печатный документ на экране
		ПечДокумент.ОтображатьЗаголовки = ОтображатьЗаголовки;
		ПечДокумент.ОтображатьСетку     = ОтображатьСетку;
		ПечДокумент.Защита              = Защита;
		ПечДокумент.ТолькоПросмотр      = ТолькоПросмотр;
		
		ПечДокумент.Показать(Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // НапечататьДокумент()

