
Функция ПолучитьТекущийТокен(Обновить = Ложь, ПортПодключения = "") Экспорт
	
	Токен = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТокеныЭДОСрезПоследних.Токен
		|ИЗ
		|	РегистрСведений.ТокеныЭДО.СрезПоследних КАК ТокеныЭДОСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() ИЛИ Обновить Тогда
		
		Токен = ОбновитьТекущийТокен(ПортПодключения);
		
	Иначе
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Токен = ВыборкаДетальныеЗаписи.Токен;
		
	КонецЕсли;
	
	Возврат Токен;
	
КонецФункции

Функция ОбновитьТекущийТокен(ПортПодключения = "")
	
	Структура = Новый Структура;
	taxId = "999999999";
	Структура.Вставить("password", "u^HS$gCX4^Wn65jE");
	Структура.Вставить("ПортПодключения", ПортПодключения);
	
	СтруктураОтвета = ЭлектронноеВзаимодействиеССерверомDidox.GetUserToken(Структура, taxId);
	
	Токен = СтрЗаменить(СтруктураОтвета, """", "");
	
	МенеджерЗаписи = РегистрыСведений.ТокеныЭДО.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период 	= ТекущаяДата();
	МенеджерЗаписи.Токен 	= Токен;
	
	МенеджерЗаписи.Записать();
	
	Возврат Токен;
	
КонецФункции