
Функция СоздатьТаблицуДляУчетаНДС() Экспорт
	тз = Новый ТаблицаЗначений;
	тз.колонки.Добавить("Период");
	тз.колонки.Добавить("Организация");
	тз.колонки.Добавить("СчетДт");
	тз.колонки.Добавить("Получатель");
	тз.колонки.Добавить("СчетКт");
	тз.колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("СуммаНДСПоУслугам",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("СуммаНДСПоИмпорту",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("Поставщик");
	тз.колонки.Добавить("Договор");
	тз.колонки.Добавить("ПриходныйДокумент");
	тз.колонки.Добавить("ЗачетНДС");
	тз.колонки.Добавить("СтавкаНДС");
	тз.колонки.Добавить("ПорядокУплатыНДС");
	Возврат тз;
КонецФункции

Функция ПолучитьТипЗачетаНДС(Счет,Услуги=Ложь) Экспорт
	Если НЕ Услуги Тогда
		Если Счет.Родитель.Код="0800" или Счет.Родитель.Код="0700" Тогда
			Возврат Перечисления.ЗачетНДС.НДСПо_ОС_НМА_НС;
		Иначе
			Возврат Перечисления.ЗачетНДС.НДСВЗачет;
		КонецЕсли; 
	Иначе
		Если Счет.Родитель.Код="0800" или Счет.Родитель.Код="0700" Тогда
			Возврат Перечисления.ЗачетНДС.НДСУслугамВСтоимость_ОС_НМА_НС;
		Иначе
			Возврат Перечисления.ЗачетНДС.НДСВЗачет;
		КонецЕсли; 
	КонецЕсли; 
КонецФункции	

Процедура ЗарегистрироватьИсходящийСчетФактуру(Ссылка, Контрагент, Документ, Сумма, СуммаНДС, Всего) Экспорт
	Движения = Ссылка.ПолучитьОбъект().Движения.ИсходящиеСчетаФактуры;
	НоваяЗапись = Движения.Добавить();
	НоваяЗапись.Период		= Ссылка.Дата;
	НоваяЗапись.Организация	= Ссылка.Организация;
	НоваяЗапись.Контрагент	= Контрагент;
	НоваяЗапись.Ссылка = Ссылка;
	Если Документ = Неопределено Тогда
		НоваяЗапись.Документ = ПолучитьСтандартноеПредставлениеДокумента(Ссылка);
	Иначе
		НоваяЗапись.Документ = Документ;
	КонецЕсли; 
	НоваяЗапись.ДокументНомер	= Ссылка.Номер;
	НоваяЗапись.ДокументДата	= Ссылка.Дата;
	НоваяЗапись.Сумма			= Сумма;
	НоваяЗапись.СуммаНДС		= СуммаНДС;
	НоваяЗапись.Всего			= Всего;
	Движения.Записать();
КонецПроцедуры
 
Функция ПолучитьСтандартноеПредставлениеДокумента(Ссылка)
	Возврат ПолучитьНомерНаПечать(Ссылка.ПолучитьОбъект())+" от "+Формат(Ссылка.Дата, "ДФ='dd.MM.yyyy ""г.""'");
КонецФункции 

Функция СоздатьТаблицуИСФ() Экспорт
	тз = Новый ТаблицаЗначений;
	тз.колонки.Добавить("Период");
	тз.колонки.Добавить("Организация");
	тз.колонки.Добавить("Контрагент");
	тз.колонки.Добавить("Ссылка");
	тз.колонки.Добавить("Документ");
	тз.колонки.Добавить("ДокументНомер");
	тз.колонки.Добавить("ДокументДата");
	тз.колонки.Добавить("СтавкаНДС");
	тз.колонки.Добавить("ВидДеятельностиНДС");
	тз.колонки.Добавить("ПорядокУплатыНДС");
	тз.колонки.Добавить("Сумма",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("СуммаНДС",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	тз.колонки.Добавить("Всего",Новый ОписаниеТипов("Число",,Новый КвалификаторыЧисла(18,2)));
	Возврат тз;
КонецФункции
 
Функция ПолучитьПорядокУплатыНДС(Период,Организация) Экспорт
	Порядок = Перечисления.ПорядокУплатыНДС.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПорядокУплатыНДССрезПоследних.Порядок
	|ИЗ
	|	РегистрСведений.ПорядокУплатыНДС.СрезПоследних(&Период, Организация = &Организация) КАК ПорядокУплатыНДССрезПоследних";
	
	Запрос.УстановитьПараметр("Период",Период);
	Запрос.УстановитьПараметр("Организация",Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Порядок = Выборка.Порядок;
	КонецЕсли;
	Возврат Порядок;
КонецФункции 
