
Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("","");
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Счет00=ПланыСчетов.Хозрасчетный.НайтиПоКоду("000");
	Для Каждого ТекСтрокаОС Из ОС Цикл
		// регистр Хозрасчетный 
		Если ТекСтрокаОС.Счет.Родитель.Код="0100" Тогда
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Организация = Организация;
			Движение.Период = Дата;
			Движение.СчетДт = ТекСтрокаОС.Счет;
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "ОсновныеСредства", ТекСтрокаОС.ОсновноеСредство);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "МОЛ", ТекСтрокаОС.МОЛ);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Подразделения", ТекСтрокаОС.Местонахождение);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "ГруппыОС", ТекСтрокаОС.ГруппаОС);
			
			Движение.СчетКт = Счет00;
			Движение.Сумма = ТекСтрокаОС.Сумма;
			
			Движение = Движения.Хозрасчетный.Добавить();
			Движение.Организация = Организация;
			Движение.Период = Дата;
			Движение.СчетДт = ТекСтрокаОС.Счет;
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "ОсновныеСредства", ТекСтрокаОС.ОсновноеСредство);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "МОЛ", ТекСтрокаОС.МОЛ);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "Подразделения", ТекСтрокаОС.Местонахождение);
			УстановитьСубконто(Движение.СчетДт, Движение.СубконтоДт, "ГруппыОС", Перечисления.ГруппыОС.ПустаяСсылка());
			
			Движение.СчетКт = Счет00;
			Движение.Сумма = -ТекСтрокаОС.Сумма;
			
		КонецЕсли; 
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция ПечатьДокумента(ИмяМакета)
	ТабДок = Новый ТабличныйДокумент;
	
	//Макет = ПолучитьОбщийМакет(ИмяМакета);
	
	//Руководители = ОтветственныеЛица(Организация, Дата);	
	//Область.Параметры.Заполнить(Руководители);
	//Область = Макет.ПолучитьОбласть("ПП");
	//Область.Параметры.Номер = ПолучитьНомерНаПечать(ЭтотОбъект);
	
	//ТабДок.Вывести(Область);
	//ТабДок.ФиксацияСверху=0;
	//ТабДок.ФиксацияСлева=0;
	//ТабДок.ЭкземпляровНаСтранице=0;
	//ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
КонецФункции

Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	// Получить экземпляр документа на печать
	
	ТабДокумент = ПечатьДокумента(ИмяМакета);
		
	НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, "");
	
КонецПроцедуры // Печать()

